[
  {
    "title": "Pico de Gallo",
    "headnote": "You don’t even need to know how to cook to make this salsa. All you need to know is how to chop (sure, you could use a machete, but a sharp chef’s knife is better!). If you’re going to buy store-bought sauces and salsas to substitute in some of the dishes in this book, I won’t be mad. But once you make fresh pico de gallo—a simple combination of chopped ripe tomatoes, cilantro, onion, jalapeño, and fresh lime juice—the prepared stuff at the supermarket will be a letdown. In the restaurant we go through hundreds of gallons of pico de gallo a week. Pico is the quintessential Mexican condiment that goes with everything on our menu and that you should put on regular rotation in your household: put it on eggs with some hot sauce in the morning, serve it with simple rice and beans, or top a piece of seared fish. While we give measurements here, they’re honestly just a suggestion; any good abuela or taquero would make it their own. Once you’ve made this a few times, you won’t even need to use a recipe anymore. The point is you want mostly tomatoes, fewer onions, less cilantro, and a hit of chile, lime, and salt. Play with the amounts and make it the way you want—if you want even coverage of your chips and tacos, chop everything into a meticulous quarter-inch dice. If you’re in a rush, go bigger. There are no strict rules.",
    "yield": "Makes about 3 cups",
    "ingredients": [
      "2 ripe medium tomatoes, cored and diced",
      "½ small red onion, diced",
      "½ small white onion, diced",
      "2 jalapeños, halved, seeds and ribs removed, diced",
      "¼ cup chopped fresh cilantro",
      "Juice of 1 lime",
      "1 tablespoon pure olive oil",
      "1 teaspoon kosher salt"
    ],
    "steps": [
      "Add the tomatoes, onions, jalapeños, cilantro, lime juice, olive oil, and salt to a medium bowl and mix well. Now taste it. Does it need more salt or acid? If so, add a pinch or two of salt (add a little at first—you can always add more, but you can’t take it away) or a squeeze of lime juice. When it tastes the way you want it to, you’re done."
    ],
    "images": [
      "../images/0783_Trej_9781984826855_art_r1.jpg",
      "../images/0782_Trej_9781984826855_art_r1.jpg"
    ],
    "source_file": "OEBPS/xhtml/c02.xhtml",
    "ingredient_count": 8,
    "step_count": 1,
    "image_count": 2
  },
  {
    "title": "Pickled Red Onions",
    "headnote": "These quick-pickled onions add a tangy-sweet crunch to any dish and can help balance out the richness of heartier, richer tacos like the carnitas ( this page ) or the shrimp ( this page ). While the flavors mellow and taste best after a night in the fridge, you can go ahead and use the onions after an hour or so of marinating.",
    "yield": "Makes about 2 cups",
    "ingredients": [
      "1 medium red onion, halved and thinly sliced",
      "½ cup apple cider vinegar",
      "1 tablespoon sugar",
      "1½ teaspoons kosher salt"
    ],
    "steps": [
      "Place the onion slices in a large heat-safe bowl.",
      "In a medium saucepan, combine ½ cup of water with the vinegar, sugar, and salt and bring to a boil over high heat. Remove from the heat and stir until the sugar and salt have dissolved. Then pour the hot liquid over the onions.",
      "Let the liquid cool to room temperature, and then cover the bowl with plastic wrap (or transfer the onions and liquid to a pint jar) and refrigerate it overnight to allow the flavors to meld and mellow. Pickled onions can be refrigerated for up to a week."
    ],
    "images": [],
    "source_file": "OEBPS/xhtml/c02.xhtml",
    "ingredient_count": 4,
    "step_count": 3,
    "image_count": 0
  },
  {
    "title": "Escabeche",
    "headnote": "Most of the food at Trejo’s is super-healthy, but sometimes Mexican food can be a little bit heavy if you’re eating something smothered in cheese or tackling a large portion of rich braised meats. That’s when you want something bright and fresh on your plate, like these pickled vegetables. Angelenos know these from all the taqueria salsa tables where you go right after getting your order to add the finishing touch of spicy-sour to your combo platter: you’ve got your red salsa, your tomatillo salsa, and your escabeche. You can add the escabeche to tacos or bowls or just eat it on the side along with chips, guacamole, and salsa.",
    "yield": "Makes about 5 cups",
    "ingredients": [
      "1 tablespoon pure olive oil",
      "4 jalapeños, sliced into ¼-inch-thick rounds",
      "2 medium carrots, sliced into ¼-inch-thick rounds",
      "1 medium white onion, sliced into ¼-inch-thick rounds",
      "8 garlic cloves",
      "2 teaspoons whole cumin seeds",
      "2½ tablespoons kosher salt",
      "2 cups apple cider vinegar",
      "4 dried chiles de árbol",
      "2 teaspoons dried oregano",
      "1 teaspoon sugar",
      "½ teaspoon whole black peppercorns"
    ],
    "steps": [
      "Heat the olive oil in a large skillet over medium heat until it is shimmering, about 2 minutes. Then add the jalapeños, carrots, onion, garlic, cumin, and a pinch of the salt. Cook, stirring occasionally, until the onions are translucent but not browned, 5 to 7 minutes. Remove from the heat and set aside.",
      "In a medium saucepan set over medium heat, combine the vinegar with 2 cups of water, the chiles, salt, oregano, sugar, and peppercorns, and bring to a simmer.",
      "Once the pickling liquid is at a simmer, add the reserved vegetables and return it to a boil. Remove the pan from the heat and set it aside to cool to room temperature.",
      "Transfer the mixture to an airtight container and refrigerate until chilled, at least 1 hour, before serving, or store it for up to 1 week."
    ],
    "images": [
      "../images/num_salsa.jpg"
    ],
    "source_file": "OEBPS/xhtml/c02.xhtml",
    "ingredient_count": 12,
    "step_count": 4,
    "image_count": 1
  },
  {
    "title": "Salsa Verde",
    "headnote": "We’ve served this as a taco topper, as a table salsa, and as a sauce for branzino and other fish specials we sometimes run at the restaurant. Cooking the whole tomatillos and jalapeño in the skillet softens the vegetables and blisters their skins, adding a deep toasty flavor to the salsa. Like our Pico de Gallo ( this page ) it’s very versatile…and very delicious.",
    "yield": "Makes about 2 cups",
    "ingredients": [
      "12 medium tomatillos (about 1½ pounds), papery skin removed, tomatillos left whole",
      "1 medium jalapeño, left whole",
      "2 garlic cloves",
      "½ medium white onion",
      "¼ cup chopped fresh cilantro",
      "Juice of 1 lime, plus extra to taste",
      "1 tablespoon kosher salt, plus extra to taste"
    ],
    "steps": [
      "Heat a large heavy skillet over medium heat until it is very hot, about 4 minutes. Add the whole tomatillos and jalapeño. They should sizzle when they hit the dry hot pan. Cook until the vegetables are black and blistered in spots and soft on one side, 5 to 7 minutes. Use tongs to turn the tomatillos and jalapeño over. Add the garlic cloves. Cook the tomatillos, jalapeño, and garlic until the tomatillos and jalapeño are blistered and the garlic cloves are toasted but not burned, 5 to 7 minutes more. Remove the pan from the heat and let the mixture cool to room temperature.",
      "Transfer the tomatillos, jalapeño, and garlic to a blender or food processor and add the onion, cilantro, lime juice, and salt. Process until the sauce is completely smooth. Taste and add more salt or lime juice if desired. Transfer the sauce to a bowl and chill before serving, or refrigerate it in an airtight container for up to 5 days."
    ],
    "images": [],
    "source_file": "OEBPS/xhtml/c02.xhtml",
    "ingredient_count": 7,
    "step_count": 2,
    "image_count": 0
  },
  {
    "title": "Salsa Roja",
    "headnote": "This is one of the most versatile salsas we have on the menu: you can put it on any of our tacos, put it in a bowl to serve with chips, or, honestly, just slather it on a store-bought rotisserie chicken. Roasting the vegetables caramelizes them and intensifies their natural sweetness. Smoky and spicy chipotles in adobo sauce add heat and depth of flavor.",
    "yield": "Makes about 3 cups",
    "ingredients": [
      "4 tablespoons pure olive oil",
      "4 medium tomatoes, cored and halved",
      "4 garlic cloves",
      "½ large white onion, roughly chopped",
      "2 jalapeños, halved, seeds and ribs removed, diced",
      "1 teaspoon kosher salt, plus extra to taste",
      "1 teaspoon freshly ground black pepper",
      "½ cup roughly chopped fresh cilantro",
      "2 chipotle chiles from a can of chipotle chiles in adobo sauce, plus 2 tablespoons of the adobo sauce",
      "Juice of 1 lime, plus extra to taste"
    ],
    "steps": [
      "Preheat the oven to 425°F.",
      "Evenly coat an 11 x 17-inch baking sheet with 2 tablespoons of the olive oil. Place the tomatoes, garlic, onion, and jalapeños on the baking sheet and season them with the salt and pepper. Roast the vegetables until they are soft and are charred in some spots, stirring them halfway through, 15 to 20 minutes.",
      "Transfer the roasted vegetables to a blender. Add the cilantro, chipotle chiles, adobo sauce, and lime juice and puree until smooth. Taste and adjust the seasoning with more salt and lime juice if needed. Serve immediately or transfer to an airtight container; the salsa will keep in the refrigerator for up to 1 week."
    ],
    "images": [],
    "source_file": "OEBPS/xhtml/c02.xhtml",
    "ingredient_count": 10,
    "step_count": 3,
    "image_count": 0
  },
  {
    "title": "Trejo’s Steak Sauce",
    "headnote": "For a while we had a bone-in rib eye on the menu at the Cantina, as a sort of homage to the great steakhouses of L.A., like the Pacific Dining Car and Musso & Frank (see this page ). We wanted to serve it with a Mexican-ish take on the classic A.1. steak sauce, so we used guajillo chiles and agave along with the flavors packed into a bottle of A.1.: it’s tangy and sweet and so good you’ll want to eat it with a spoon.",
    "yield": "Makes about 2 cups",
    "ingredients": [
      "1 medium head garlic (about 10 cloves), cloves separated and peeled",
      "1 large red onion, roughly diced",
      "6 dried guajillo chiles, stems and seeds removed",
      "½ cup canola oil",
      "Juice of 1 lime",
      "2 tablespoons agave syrup",
      "1 tablespoon adobo sauce from a can of chipotles in adobo (see Trejo’s Tip)",
      "2 teaspoons kosher salt, plus extra to taste",
      "1 teaspoon chipotle chile powder",
      "1 teaspoon ground cumin",
      "1 teaspoon red wine vinegar"
    ],
    "steps": [
      "Preheat the oven to 350˚F.",
      "Spread the garlic cloves and diced onion on an 11 x 17-inch sheet pan and bake until they are golden brown and soft, about 45 minutes. Leaving the oven on, transfer the garlic and onions to a blender.",
      "Place the guajillo chiles on the sheet pan and bake them until they are fragrant and lightly toasted, 2 to 5 minutes.",
      "Meanwhile, in a medium saucepan, bring 4 cups of water to a low boil. Remove the pan from the heat and let the water cool for 5 minutes.",
      "Add the chiles to the water, cover the saucepan, and set it aside for 20 minutes to let the chiles soften.",
      "Drain the chiles and roughly chop them. Put them in the blender with the garlic and onions and add the oil, lime juice, agave, adobo sauce, salt, chile powder, cumin, and red wine vinegar. Blend until smooth, then taste and add more salt if needed. Serve immediately or refrigerate in an airtight container for up to 5 days."
    ],
    "images": [
      "../images/0790_Trej_9781984826855_art_r1.jpg"
    ],
    "source_file": "OEBPS/xhtml/c02.xhtml",
    "ingredient_count": 11,
    "step_count": 6,
    "image_count": 1
  },
  {
    "title": "Pepita Pesto",
    "headnote": "In the spirit of zero waste of food, effort, or the funds needed to make this pesto, we encourage you to come up with new ways of using it. At the restaurant it’s served as a sauce for the Carne Asada Burritos ( this page ), but don’t let that keep you from serving it with grilled steak or chicken, or, yes, pasta. Vegan mayonnaise gives this creamy vinaigrette the body of ranch dressing with the acidity and brightness of a vinaigrette, so you really get the best of both worlds. We use it to dress our kale salad. It would also be great on a simple green salad, served as a sauce alongside seared salmon or grilled chicken, or drizzled on any of our bowls. If you happen to have some extra escabeche in your fridge, use it in this fresh and spicy crema. Otherwise, buy a can or jar of Embasa pickled jalapeños. (It’s not worth cooking a whole batch of escabeche just for the 2 tablespoons needed for this recipe.) I love this with seared fish and on our chicken tikka tacos ( this page ). You don’t have to be vegan to love this crema. Pureed cashews are so buttery, you’ll swear this is made with dairy. The zippy acidity in this lime crema makes it particularly good with fried food, which is why we use it to dress the slaw that goes on the fried fish tacos ( this page ). Zesting the lime with a rasp-style grater (like a Microplane) will make this easy crema even easier. This is one of the easiest, most full-flavored, and most satisfying sauces in this book—and watch out, it’s spicy! Play it safe; start with 4 chipotles, taste, and then add more if you think you can handle it. We serve this earthy crema with our sautéed fish tacos ( this page ), but it’s super-versatile and would also go well with the fried fish tacos ( this page ) or our chicken tikka tacos ( this page ). Creamy avocado meets tangy sour cream in this cooling crema that you can use on any of our tacos. We use this to top our tacos, burritos, and bowls made with Blackened Salmon ( this page ), but it would go well with chicken or shrimp dishes, too. While we typically use fresh juices at the restaurant, orange juice concentrate delivers a lot of flavor without watering down the crema. Mayonnaise adds more acidity to balance out the sweetness of the orange.",
    "yield": "Makes about 1 cup",
    "ingredients": [
      "About 1½ cups roughly chopped fresh cilantro",
      "About 2 cups roughly chopped fresh flat-leaf parsley",
      "6 garlic cloves",
      "1 cup unsalted raw pepitas (pumpkin seeds)",
      "½ teaspoon kosher salt, plus extra to taste",
      "½ cup pure olive oil",
      "1½ cups chopped fresh cilantro",
      "½ cup vegenaise (Just Mayo is good, too)",
      "Juice of 1 lime",
      "1 cup sour cream",
      "2 tablespoons chopped pickled jalapeños or Escabeche ( this page )",
      "Juice of 1 lime",
      "1 tablespoon roughly chopped fresh mint leaves",
      "1 teaspoon ground cumin",
      "1 teaspoon kosher salt",
      "¼ teaspoon cayenne pepper",
      "2 cups raw unsalted cashews",
      "Juice of 1 lime, plus extra to taste",
      "Juice of 1 lemon, plus extra to taste",
      "1½ teaspoons kosher salt, plus extra to taste",
      "1 cup sour cream",
      "1 teaspoon finely chopped lime zest",
      "Juice of 1 lime",
      "1 teaspoon kosher salt",
      "2 cups sour cream",
      "4 chipotle chiles from a can of chipotle chiles in adobo sauce, plus 2 tablespoons of the adobo sauce",
      "Juice of 2 limes",
      "2 teaspoons kosher salt",
      "1 cup sour cream",
      "2 tablespoons ground cumin",
      "1 teaspoon kosher salt",
      "2 medium avocados, halved, pitted, and peeled",
      "½ cup sour cream",
      "½ cup roughly chopped fresh cilantro",
      "Juice of 1 lime, plus extra to taste",
      "1 teaspoon kosher salt, plus extra to taste",
      "½ cup sour cream",
      "½ cup mayonnaise",
      "½ cup orange juice concentrate, thawed"
    ],
    "steps": [
      "Put the cilantro and parsley in a food processor and add the garlic, pepitas, and salt. Pulse for 5 seconds and then scrape down the sides of the bowl. Repeat the pulsing and scraping about 5 more times, until the ingredients are finely minced. While the machine is running, slowly pour the olive oil through the feed tube, processing until the pesto is combined and looks like coarse meal, about 30 seconds, scraping down sides if necessary.",
      "Taste and adjust the seasoning with more salt as needed. Use the pesto immediately or transfer it to an airtight container or glass jar (see Trejo’s Tip) and refrigerate it for up to 3 days.",
      "For a creamy-smooth dressing, combine the cilantro, vegenaise, lime juice, and ¼ cup of water in a blender and puree until smooth. For a chunkier vinaigrette, combine everything in a medium bowl and whisk until emulsified (that’s the fancy word for thoroughly mixed so that the juice is suspended evenly throughout the fats). Use immediately or refrigerate in an airtight container for up to 5 days.",
      "Put the sour cream, jalapeño, lime juice, mint, cumin, salt, and cayenne in a blender and puree until smooth. Serve immediately or transfer to an airtight container and refrigerate for up to 3 days.",
      "Place the cashews in a blender jar and cover them with 1½ cups of water. Set the cashews aside to soak for at least 2 hours or up to overnight. The longer they soak, the softer they’ll get, making for a creamier result.",
      "Pour off the water and add the lime juice, lemon juice, and salt to the cashews. Puree until creamy and smooth. Taste and adjust with more salt, lemon, and/or lime juice if needed. Use immediately or refrigerate in an airtight container for up to 5 days.",
      "In a small mixing bowl, combine the sour cream, lime zest, lime juice, and salt and mix well. Serve immediately or refrigerate in an airtight container for up to 3 days.",
      "Put the sour cream, chipotles, adobo sauce, lime juice, and salt in a blender and puree until smooth. Serve immediately or transfer to an airtight container and refrigerate for up to 3 days.",
      "In a small mixing bowl, whisk together the sour cream, cumin, and salt until well combined. Use immediately, or refrigerate in an airtight container for up to 3 days",
      "Combine the avocados, sour cream, cilantro, lime juice, and salt in a blender and puree until smooth. Taste and add more salt or lime juice if desired. Use immediately or store in an airtight container for up to 3 days.",
      "In a medium bowl, combine the sour cream, mayonnaise, and orange juice concentrate and mix well to combine. Use immediately or refrigerate in an airtight container for up to 3 days."
    ],
    "images": [
      "../images/0781_Trej_9781984826855_art_r1.jpg",
      "../images/num_crema.jpg"
    ],
    "source_file": "OEBPS/xhtml/c02.xhtml",
    "ingredient_count": 39,
    "step_count": 11,
    "image_count": 2
  },
  {
    "title": "Cheesy Bean Dip",
    "headnote": "You can use this super simple bean dip in our Breakfast Burrito ( this page ) or our BCR Burritos ( this page ), add it to a quesadilla (beginning on this page ), or serve it as intended, with tortilla chips and alongside some good salsa. It’s also great served with scrambled eggs and hot sauce.",
    "yield": "Makes about 2 cups",
    "ingredients": [
      "1 (16-ounce) can refried beans",
      "½ cup cream cheese, at room temperature",
      "1 cup shredded Mexican-style cheese blend, store-bought or homemade (see this page )",
      "1 tablespoon chopped pickled jalapeños",
      "1 tablespoon pickled jalapeño juice",
      "1 tablespoon crumbled Cotija",
      "Hot sauce, such as Trejo’s, Cholula,or Tapatío (optional)"
    ],
    "steps": [
      "Add the beans to a medium saucepan set over medium heat and stir occasionally until they are warmed through, about 5 minutes.",
      "Add the cream cheese a spoonful at a time and stir to combine. Once combined, reduce the heat to low. Add the cheese blend and stir until thoroughly combined and melted. Add the pickled jalapeños and jalapeño juice. Serve hot, garnished with the Cotija and hot sauce, if desired."
    ],
    "images": [
      "../images/0751_Trej_9781984826855_art_r1.jpg"
    ],
    "source_file": "OEBPS/xhtml/c02.xhtml",
    "ingredient_count": 7,
    "step_count": 2,
    "image_count": 1
  },
  {
    "title": "Chipotle shrimp Cocktail SAUCE",
    "headnote": "Let’s face it: shrimp cocktail is really all about the sauce. You might notice that chipotle chiles in adobo sauce show up in a lot of our recipes. That’s because they’re so damn delicious, adding an incredible smoky-hot flavor to everything you mix them with—even sauce for a shrimp cocktail. I had the chefs put this sauce with shrimp on the menu because I love a steakhouse shrimp cocktail, but nobody ordered it (I guess it was too out there for a Mexican joint)—the sauce is so good, though, I wanted it to have a space in this book. You can serve it with some precooked shrimp from the grocery or poach your own, but I highly recommend serving it alongside the Citrus, Herb & Garlic Shrimp ( this page ), which can be prepared in big batches, making it a perfect finger or fork-friendly party food. Your guests will thank you and you will thank me. You’re welcome.",
    "yield": "Makes about 1½ cups",
    "ingredients": [
      "4 chipotle chiles from a can of chipotle chiles in adobo sauce",
      "Juice of 1 lime",
      "1 tablespoon white balsamic vinegar",
      "1 tablespoon molasses",
      "2 tablespoons dark brown sugar",
      "2 tablespoons soy sauce",
      "1 cup ketchup",
      "2 tablespoons bottled horseradish",
      "Juice of ½ lemon",
      "1 teaspoon Worcestershire sauce",
      "Citrus, Herb & Garlic Shrimp ( this page ) or poached shrimp"
    ],
    "steps": [
      "Finely chop the chipotles, mashing them against the cutting board until they form a smooth paste. Transfer the paste to a small saucepan, add the lime juice and vinegar, and whisk to combine. Stir in the molasses and sugar, and slowly warm the sauce over medium heat, stirring occasionally, until the sugar dissolves and the volume reduces to a paste consistency, about 3 minutes. Stir in the soy sauce and set it aside to cool.",
      "In a medium bowl, combine the ketchup with the horseradish, lemon juice, and Worcestershire sauce. Stir in the cooled chipotle-molasses mixture. Cover the bowl with plastic wrap and refrigerate until chilled, about 30 minutes. Serve with the cooked shrimp. (The sauce can be refrigerated for up to 5 days.)"
    ],
    "images": [
      "../images/0309_Trej_9781984826855_art_r1.jpg",
      "../images/0811_Trej_9781984826855_art_r1.jpg",
      "../images/2003_Trej_9781984826855_art_r17.jpg"
    ],
    "source_file": "OEBPS/xhtml/c02.xhtml",
    "ingredient_count": 11,
    "step_count": 2,
    "image_count": 3
  },
  {
    "title": "Classic Fish Tacos",
    "headnote": "This taco is simple, with very few components that need cooking, and it makes a great 20-minute weeknight meal. It’s the healthiest of the three fish tacos we serve because it’s pan-cooked and not fried. If you’re a pescatarian, you’re going to love these. You could eat these every day and probably live forever.",
    "yield": "Makes 8 tacos",
    "ingredients": [
      "1½ pounds fresh cod, cut into 3-inch pieces",
      "Kosher salt",
      "Freshly ground black pepper",
      "4 tablespoons pure olive oil",
      "1 lime, halved",
      "1 cup shredded red or green cabbage",
      "¼ cup Cumin Crema ( this page )",
      "¼ cup chopped fresh cilantro",
      "8 6-inch corn tortillas",
      "¼ cup Pico de Gallo ( this page )"
    ],
    "steps": [
      "Pat the cod dry with paper towels and season it with salt and pepper. In a large pan set over medium-high heat, heat 2 tablespoons of the oil until it is just shimmering, about 2 minutes. Add the cod and cook until the pieces are lightly browned and just cooked through, about 3 minutes per side. Use a spatula to transfer the cooked cod to a large plate, and then squeeze the lime halves over it.",
      "In a medium bowl, combine the cabbage with the remaining 2 tablespoons oil, the Cumin Crema, and the cilantro. Season with salt to taste.",
      "Preheat the oven to 250°F.",
      "Stack the tortillas, wrap them in aluminum foil, place them in the oven, and let them warm until they’re fragrant and pliable, about 15 minutes.",
      "Remove the tortillas from the oven. Unwrap the stack and line up the tortillas, assembly-line-style, on your work surface. Place a dollop of the slaw mixture on each tortilla. Top it with the fish and Pico de Gallo, and serve."
    ],
    "images": [
      "../images/dusk3.jpg",
      "../images/dusk4.jpg"
    ],
    "source_file": "OEBPS/xhtml/c03.xhtml",
    "ingredient_count": 10,
    "step_count": 5,
    "image_count": 2
  },
  {
    "title": "OG Beer-Battered Fried Fish Tacos",
    "headnote": "Not all fish tacos are created equal: you’ve got your Baja Fish Tacos ( this page ) that are battered and fried, you’ve got your basic healthy-ish pan-seared fish tacos ( this page ), and then you’ve got the variations we’ve played with. We’ve had fried fish tacos on our menu from the beginning and have served two versions: one, the OG, is beer-battered; the Baja Fish Tacos are tortilla chip–battered. They’re both incredible, so we’re going to share both of them with you.",
    "yield": "Makes 8 tacos",
    "ingredients": [
      "¾ cup all-purpose flour",
      "¼ cup cornstarch",
      "1½ teaspoons paprika",
      "1 teaspoon kosher salt, plus extra to taste",
      "¼ teaspoon baking powder",
      "1 cup cold light Mexican beer, such as Modelo Especial",
      "1 cup shredded red or green cabbage",
      "1 cup Pico de Gallo ( this page )",
      "¼ cup Lime Crema ( this page )",
      "¼ cup finely chopped fresh cilantro",
      "2 tablespoons pure olive oil",
      "4 cups canola oil",
      "1½ pounds fresh cod, cut into 2-inch pieces",
      "8 6-inch flour or corn tortillas"
    ],
    "steps": [
      "In a medium bowl, combine the flour, cornstarch, paprika, salt, and baking powder and mix well. While lightly whisking, slowly pour in the beer. Do not overmix—you want the batter to be a little frothy. If you’re not going to fry your fish immediately, keep the batter cool by placing the bowl in a larger bowl filled with ice.",
      "In another medium bowl, combine the cabbage, Pico de Gallo, Lime Crema, cilantro, and olive oil and mix well. Season to taste with salt and set aside.",
      "In a large deep pot set over medium-high heat, heat the canola oil until it reaches 350°F on an instant-read thermometer. Working in batches, coat the fish in the beer batter and gently lower it into the hot oil, taking care not to crowd the pot. Fry the fish, turning the pieces often, until they are golden brown, about 3 minutes. Transfer them to a wire rack to drain. Let the oil return to 350°F before frying the next batch of fish.",
      "Preheat the oven to 250°F.",
      "Stack the tortillas, wrap them in aluminum foil, place them in the oven, and let them warm until they’re fragrant and pliable, about 15 minutes.",
      "Remove the tortillas from the oven. Unwrap the stack and line up the tortillas, assembly-line-style, on your work surface. Place a few pieces of fish on each tortilla, and top them with the cabbage slaw."
    ],
    "images": [
      "../images/0742_Trej_9781984826855_art_r1.jpg"
    ],
    "source_file": "OEBPS/xhtml/c03.xhtml",
    "ingredient_count": 14,
    "step_count": 6,
    "image_count": 1
  },
  {
    "title": "Baja Fish Tacos",
    "headnote": "Down in Baja, just south of the California–Mexico border, fried fish tacos are synonymous with street food in the coastal beach towns. We use tortillas every which way you (and we) can imagine. But would you ever think we’d pulverize fried tortilla chips in a blender until they’re like flour and then coat fish in it and fry it? It adds this incredible additional crunch and flavor to our Baja Fish Tacos. (You can also use this preparation on shrimp.) These tacos are topped with sweet-hot mango salsa and tangy spicy Tajín. We call this “blackened salmon” because it’s an homage to the old Cajun preparation in which a piece of fish is coated in so many spices, and so much pepper, that it looks black after a quick sear in a hot pan. The Cajuns used butter, which would char and burn a little. We like to do things a little healthier than that, so we skip the butter and push the chili powder. And while we do cook it over high heat, it doesn’t get very black—just seared in spots. Cherry tomatoes taste supersweet when you pair them with the spicy salmon. Orange Crema ( this page ) cools everything down.",
    "yield": "Makes 4 bowls",
    "ingredients": [
      "1 12-ounce bag tortilla chips",
      "2 cups rice flour",
      "2 cups buttermilk",
      "1½ pounds fresh cod, cut into 2-inch pieces",
      "Oil for frying",
      "8 6-inch flour or corn tortillas",
      "2 cups shredded green cabbage",
      "¼ cup Chipotle Crema ( this page )",
      "1 cup Avocado Crema ( this page )",
      "½ cup store-bought mango salsa",
      "1 tablespoon Tajín seasoning (see Trejo’s Tip, this page )",
      "3 tablespoons chili powder",
      "2 teaspoons ground coriander",
      "2 teaspoons freshly ground black pepper",
      "1 teaspoon ground fennel",
      "1 teaspoon dried thyme",
      "1 teaspoon kosher salt",
      "1 1½-pound salmon fillet, skin removed, cut into four 6-inch strips",
      "2 tablespoons vegetable oil",
      "12 6-inch corn tortillas",
      "1 tablespoon canola oil",
      "1 cup cherry tomatoes, left whole",
      "1 cup fresh corn kernels (from about 1 ear)",
      "½ cup Orange Crema ( this page )",
      "2 cups shredded green or red cabbage",
      "Kosher salt",
      "Freshly ground black pepper",
      "1 recipe Blackened Salmon ( this page ), cut into 1-inch pieces",
      "2 limes, each cut into 6 wedges",
      "2 cups Spanish Rice ( this page ), warmed",
      "2 cups Basic Black Beans ( this page ), warmed",
      "2 cups grilled corn (see this page )",
      "1 cup Pico de Gallo ( this page )",
      "1 cup shredded romaine lettuce",
      "1 recipe Blackened Salmon ( this page ), cut into 1-inch pieces",
      "¼ cup Orange Crema ( this page )",
      "¼ cup finely chopped red onion",
      "¼ cup chopped fresh cilantro"
    ],
    "steps": [
      "Bread and Fry the Fish In a food processor, finely grind the tortilla chips until they form a fine powder. In three separate bowls, place the rice flour, buttermilk, and ground tortilla chips. One piece at a time, dredge the fish in the flour first, shaking off the excess. Then dunk it in the buttermilk, letting the excess drip back into the bowl. Lastly, dredge the fish through the ground tortilla chips, making sure to coat all sides. Set the fish aside on a plate or platter.",
      "Fill a large deep pot halfway with oil. Heat over medium-high heat until the oil reaches 350°F on an instant-read thermometer. Working in batches, gently lower a few pieces of fish into the hot oil. Fry, turning the fish occasionally, until they are golden brown, about 3 minutes. Transfer the fish to a wire rack or to paper towels to drain. Let the oil come back up to 350°F before adding the next batch of fish.",
      "Make the Tacos Preheat the oven to 250°F.",
      "Stack the tortillas, wrap them in aluminum foil, place them in the oven, and let them warm until they’re fragrant and pliable, about 15 minutes.",
      "Remove the tortillas from the oven. Unwrap the stack and line up the tortillas, assembly-line-style, on your work surface.",
      "In a medium mixing bowl, combine the cabbage with the Chipotle Crema. Spread a line of Avocado Crema down the center of each tortilla. Place 2 pieces of fish on the Avocado Crema and then add a spoonful of mango salsa in between the pieces of fish. Garnish with the cabbage mixture. Sprinkle with Tajín and serve.",
      "In a medium bowl, mix the chili powder, coriander, pepper, fennel, thyme, and salt. Toss the salmon pieces in the spices to coat them thoroughly on all sides, shaking off any excess.",
      "In a large skillet set over medium-high heat, heat the oil until it’s just smoking, about 3 minutes. Place the salmon in the skillet and cook until it is browned on the bottom and cooked halfway through (it should no longer be translucent on the bottom half), about 2 minutes. Turn the salmon over and cook until it is firm and no longer translucent at all, about 2 minutes more.",
      "Serve the cooked salmon in any of our fish taco preparations or in a bowl.",
      "Preheat the oven to 250°F.",
      "Stack the tortillas, wrap them in aluminum foil, place them in the oven, and let them warm until they’re fragrant and pliable, about 15 minutes.",
      "Remove the tortillas from the oven. Unwrap the stack and line up the tortillas, assembly-line-style, on your work surface.",
      "Heat the oil in a medium skillet set over medium heat until it is smoking, about 3 minutes. Add the cherry tomatoes and the corn, and cook until the tomatoes are slightly blistered and the corn is lightly toasted, about 2 minutes. Remove the skillet from the heat and set aside.",
      "In a medium bowl, combine ¼ cup of the Orange Crema with the cabbage and mix well. Season with salt and pepper to taste.",
      "Divide the remaining ¼ cup Orange Crema among the tortillas, spreading it over the center of each one. Add the salmon in a straight line down the center, top with the tomato/corn mixture, and garnish with the cabbage slaw. Serve each taco with a lime wedge.",
      "In each individual serving bowl, arrange evenly divided portions of the rice, beans, corn, Pico de Gallo, lettuce, and salmon in a clockwise pattern. Drizzle with the Orange Crema. Garnish with the onion and cilantro."
    ],
    "images": [
      "../images/0740_Trej_9781984826855_art_r1.jpg",
      "../images/2007_Trej_9781984826855_art_r19.jpg",
      "../images/2005_Trej_9781984826855_art_r117.jpg",
      "../images/0743_Trej_9781984826855_art_r1.jpg",
      "../images/0802_Trej_9781984826855_art_r1.jpg"
    ],
    "source_file": "OEBPS/xhtml/c03.xhtml",
    "ingredient_count": 38,
    "step_count": 16,
    "image_count": 5
  },
  {
    "title": "Gringo Tacos",
    "headnote": "“Gringo Taco” is sort of a joke name because a lot of non-Mexicans first started loving tacos thanks to Taco Bell, which for the record did not invent the hard-shell taco filled with spiced ground meat, which is basically what a Gringo Taco is. It’s beefy and mildly spicy and really good. Its origins are a little fuzzy but it most likely was first cooked up in Texas, where beef was plentiful and Mexican immigrants made the most of what they had at hand. This is hot and sweet and will blow your head off in the best way. If you don’t like your food too spicy, feel free to only use two chipotles.",
    "yield": "Makes 4 burritos",
    "ingredients": [
      "Gringo Seasoning",
      "2 teaspoons onion powder",
      "1½ teaspoons dried red pepper flakes or chopped dried chile de árbol",
      "1 tablespoon chili powder",
      "1½ teaspoons ground cumin",
      "1½ teaspoons sweet paprika",
      "1 teaspoon garlic powder",
      "1 teaspoon dried oregano",
      "2 tablespoons canola oil",
      "1 medium white onion, diced",
      "1½ pounds 80% lean ground beef",
      "1 teaspoon kosher salt",
      "½ teaspoon freshly ground black pepper",
      "12 hard-shell tacos",
      "¼ cup shredded Mexican-style cheese blend, store-bought or homemade (see this page )",
      "¼ cup shredded iceberg lettuce",
      "Hot sauce, such as Trejo’s, Cholula, or Tapatío",
      "1½ cups Pico de Gallo ( this page )",
      "1 medium head of garlic (about 10 cloves), cloves separated and peeled",
      "½ cup plus 2 tablespoons pure olive oil",
      "4 chipotle chiles from a can of chipotle chiles in adobo sauce, plus 2 tablespoons of the sauce",
      "1 teaspoon garlic powder",
      "¼ cup honey",
      "Juice of 1 lime",
      "¾ teaspoon kosher salt",
      "1 pound jumbo shrimp, peeled and deveined",
      "12 6-inch corn tortillas",
      "1 cup shredded red cabbage",
      "¼ cup Pickled Red Onions ( this page )",
      "½ cup Avocado Crema ( this page )",
      "3 cups Grilled Spicy Diablo Shrimp ( this page )",
      "Finely chopped fresh cilantro",
      "2 limes, each cut into 6 wedges",
      "1 cup shredded red cabbage",
      "½ cup Pickled Red Onions ( this page )",
      "4 13-inch flour tortillas",
      "½ cup shredded Mexican-style cheese blend, store-bought or homemade (see this page )",
      "1 cup Spanish Rice ( this page ), warmed",
      "1 cup Basic Black Beans ( this page ), warmed",
      "2 cups Grilled Spicy Diablo Shrimp ( this page )",
      "1 cup Avocado Crema ( this page )",
      "Salsa Roja ( this page ), for serving"
    ],
    "steps": [
      "Make the Gringo Seasoning In a medium bowl, mix the onion powder, red pepper flakes, chili powder, cumin, paprika, garlic powder, and oregano.",
      "cook the beef Heat the oil in a large skillet over medium-high heat until it is shimmering, about 2 minutes. Add the onion and cook until it is soft and translucent, 5 to 7 minutes. Add the beef and the Gringo Seasoning and cook, stirring occasionally, until the beef is browned, about 15 minutes. Add ½ cup of water and use a wooden spoon to scrape up the bits from the bottom. Cook until most of the water has evaporated, about 5 minutes. Add the salt and pepper and stir to combine. Remove from the heat and set aside to cool.",
      "Make the tacos Divide the beef among the taco shells, top each taco with the cheese, and then add the lettuce. Serve with hot sauce to taste and the Pico de Gallo.",
      "Make the Diablo Sauce Preheat the oven to 350°F. On a rimmed baking sheet, toss the garlic cloves with 2 tablespoons of the olive oil. Bake, stirring midway through, until the garlic is soft and medium brown but not too dark. Check at 30 minutes and, if it’s getting too dark, remove. If not, cook for up to 45 minutes.",
      "Place the remaining ½ cup oil, the roasted garlic and oil from the baking sheet, the chiles with the 2 tablespoons adobo sauce, and the garlic powder in a blender and puree. While the blender is running, slowly drizzle in the honey. Add the lime juice and salt, and puree until smooth.",
      "Marinate the Shrimp Transfer the diablo sauce to a large bowl, add the shrimp, and mix until the shrimp are well coated. Place the bowl in the refrigerator and marinate the shrimp for at least 10 minutes and up to 1 hour.",
      "Grill the Shrimp Heat a charcoal or gas grill to medium heat. Place the shrimp on the hot grill and cook until grill marks appear, about 3 minutes. Turn the shrimp over and cook until firm, about 3 minutes more. (Or, if you are cooking them on the stove, preheat 1 tablespoon of neutral oil in a large skillet until it is hot. Add the shrimp and cook until they are firm and lightly caramelized, about 3 minutes per side.)",
      "Serve the shrimp in tacos or burritos.",
      "Preheat the oven to 250°F.",
      "Stack the tortillas, wrap them in aluminum foil, place them in the oven, and let them warm until they’re fragrant and pliable, about 15 minutes.",
      "Remove the tortillas from the oven. Unwrap the stack and line up the tortillas, assembly-line-style, on your work surface.",
      "In a medium bowl, stir together the cabbage and pickled onions. Drizzle the Avocado Crema down the center of each tortilla. Place the cabbage-onion slaw in a straight line over the crema and set the shrimp on top of the slaw. Sprinkle with the cilantro and serve with the lime wedges.",
      "In a medium bowl, stir together the cabbage and pickled onions.",
      "Place a tortilla in a large skillet set over medium heat, warming it until it is heated through and lightly browned in spots, about 1 minute. Turn the tortilla over and warm it on the second side, 1 minute more. Transfer the tortilla to a plate and cover it with a kitchen towel to keep it warm. Repeat with the remaining tortillas.",
      "Lay the tortillas out on your work surface. Sprinkle 2 tablespoons of the cheese in a straight line across the middle of each tortilla. Layer ¼ cup of the rice, ¼ cup of the beans, and ½ cup of the shrimp on top of the cheese. Top the shrimp with the cabbage-onion mixture. Drizzle the Avocado Crema over the top. Fold the left and right sides of each tortilla in by 1 inch. Grab the bottom of the tortilla and roll it away from you, ensuring the sides are tucked in. Serve with Salsa Roja on the side."
    ],
    "images": [
      "../images/0766_Trej_9781984826855_art_r1.jpg",
      "../images/2007_Trej_9781984826855_art_r111.jpg",
      "../images/2005_Trej_9781984826855_art_r119.jpg",
      "../images/0758_Trej_9781984826855_art_r1.jpg",
      "../images/2003_Trej_9781984826855_art_r112.jpg"
    ],
    "source_file": "OEBPS/xhtml/c03.xhtml",
    "ingredient_count": 42,
    "step_count": 15,
    "image_count": 5
  },
  {
    "title": "Mexi-Falafel Tacos",
    "headnote": "Hearty Tuscan kale works best in this taco if it is sliced super thin. Remove the fibrous center rib before slicing the leaves.",
    "yield": "Makes 12 tacos",
    "ingredients": [
      "¼ cup tahini",
      "2 tablespoons pure olive oil",
      "Juice of 1 lemon",
      "¼ teaspoon ground cumin",
      "¼ teaspoon kosher salt",
      "1 16-ounce box falafel mix, such as Trader Joe’s brand",
      "2 cups neutral oil, such as safflower or canola",
      "12 6-inch corn tortillas",
      "1½ cups finely sliced Tuscan kale (from about 4 leaves)",
      "½ cup Pickled Red Onions ( this page )",
      "2 limes, each cut into 6 wedges"
    ],
    "steps": [
      "In a medium bowl, combine the tahini, olive oil, lemon juice, cumin, salt, and 2 tablespoons of water and stir well. Set aside.",
      "Prepare the falafel mixture according to the package instructions, and then form it into 1-inch balls. Fry the falafel in the oil per the box instructions.",
      "Preheat the oven to 250°F.",
      "Stack the tortillas, wrap them in aluminum foil, place them in the oven, and let them warm until they’re fragrant and pliable, about 15 minutes.",
      "Remove the tortillas from the oven. Unwrap the stack and line up the tortillas, assembly-line-style, on your work surface.",
      "Drizzle each tortilla with the tahini sauce in a zigzag pattern. Place the kale in a straight line down the center of each tortilla. Set the falafel balls in a straight line on top of the kale. Top the falafel with the pickled onions and serve a lime wedge with each taco."
    ],
    "images": [
      "../images/0761b_Trej_9781984826855_art_r1.jpg"
    ],
    "source_file": "OEBPS/xhtml/c03.xhtml",
    "ingredient_count": 11,
    "step_count": 6,
    "image_count": 1
  },
  {
    "title": "Jackfruit Tacos",
    "headnote": "I’m going to sound like a jerk here, but I used to feel sorry for vegans. Owning Trejo’s Tacos changed that. While I like to cook, I knew I needed to turn to the professionals to dial in the recipes. When the chefs were creating the taco menu, we knew we wanted vegan options and I thought that might just mean a lot of rice and bean burritos and papas con rajas (potato and chile) tacos. One day they presented me with some new menu options and handed me a taco with a savory shredded filling that was spicy and tender. I was like: “What kind of meat is this? It’s delicious.” They said: “It’s jackfruit.” I had no idea what jackfruit was, but it turns out it’s one of the world’s superfoods and grows all over Southeast Asia. It’s full of nutrients, and when you cook it in the same marinade we use for our Carne Asada, I swear you’ll think it’s meat. And if you’re vegan you’re going to be very, very happy.",
    "yield": "Makes 12 tacos",
    "ingredients": [
      "2 9.9-ounce cans jackfruit (about 2 cups)",
      "1½ cups Carne Asada marinade ( this page )",
      "Kosher salt",
      "Freshly ground black pepper",
      "12 6-inch corn tortillas",
      "1 cup shredded red cabbage",
      "1 tablespoon Salsa Verde ( this page ; or use store-bought)",
      "¼ cup Avocado Crema ( this page )",
      "1½ cups Pico de Gallo ( this page ; or use store-bought)"
    ],
    "steps": [
      "Cook the Jackfruit Drain the jackfruit and pat it dry with paper towels. In a medium saucepan, stir the jackfruit with the Carne Asada marinade. Set the pan over medium-low heat and cook the jackfruit until it starts to break down and shred, about 45 minutes. Taste and adjust the seasoning with salt and pepper if desired. Remove the pan from the heat.",
      "make the tacos Preheat the oven to 250°F. Stack the tortillas, wrap them in aluminum foil, place them in the oven, and let them warm until they’re fragrant and pliable, about 15 minutes. Unwrap the stack and line up the tortillas, assembly-line-style, on your work surface. In a small bowl, mix the cabbage with the Salsa Verde and season it to taste with salt and pepper.",
      "Drizzle each tortilla with the Avocado Crema. Place some warm jackfruit in a straight line down the center of each tortilla. Spoon a line of the Salsa Verde slaw on top of the jackfruit, and then top with a line of the Pico de Gallo."
    ],
    "images": [
      "../images/0768_Trej_9781984826855_art_r1.jpg"
    ],
    "source_file": "OEBPS/xhtml/c03.xhtml",
    "ingredient_count": 9,
    "step_count": 3,
    "image_count": 1
  },
  {
    "title": "Bacon Cheeseburger Tacos",
    "headnote": "L.A. is a burger town. We’ve got Fatburger, The Apple Pan, and In-N-Out, with its secret menu where all the really good stuff is hidden unless you know what to ask for. And now we’ve got the Trejo’s bacon cheeseburger taco. Who needs a double double animal style when you’ve got this bacon cheeseburger taco? You won’t find this on In-N-Out’s secret menu. Yet. We call this vegan filling “asada” even though it’s technically not an asada (which is Spanish for “grilled”), because it does use the same marinade that goes on our Carne Asada. Mushrooms soak up all the spicy, savory flavors and make a hearty taco filling.",
    "yield": "Makes 4 bowls",
    "ingredients": [
      "1 pound 80% lean ground beef",
      "¼ cup Gringo Seasoning ( this page )",
      "2 tablespoons neutral oil, such as canola",
      "12 6-inch corn tortillas",
      "1½ cups shredded Mexican-style cheese blend, store-bought or homemade (see this page )",
      "¼ cup finely chopped red onion",
      "¼ cup finely chopped fresh cilantro",
      "12 cherry tomatoes, quartered",
      "½ cup roughly chopped crisp-cooked bacon",
      "1 pound mushrooms, such as cremini, stemmed and sliced",
      "1½ cups Carne Asada marinade ( this page )",
      "2 tablespoons pure olive oil",
      "12 6-inch corn tortillas",
      "1½ cups shredded green cabbage",
      "¼ cup Salsa Verde ( this page )",
      "1 recipe Mushroom Asada ( this page )",
      "½ cup Pepita Pesto ( this page )",
      "3 limes, quartered (12 wedges)",
      "2 cups Spanish Rice ( this page ), warmed",
      "2 cups Basic Black Beans ( this page ), warmed",
      "2 cups grilled corn (see this page )",
      "1 cup Pico de Gallo ( this page )",
      "1 cup shredded romaine lettuce",
      "1 recipe Mushroom Asada ( this page )",
      "½ cup Pepita Pesto ( this page )"
    ],
    "steps": [
      "In a large bowl, combine the ground beef and the Gringo Seasoning, using your hands to evenly distribute the seasoning without overworking the meat. Form the meat into 4 patties, each one about ¾ inch thick.",
      "Heat the oil in a large heavy-bottomed pan or cast-iron skillet over medium-high heat until it is shimmering and just smoking, about 2 minutes. Sear the patties in the hot pan until they are crisp and deeply browned on the bottom, about 5 minutes. Turn the patties over and cook on the other side for 4 minutes for medium doneness. Transfer the patties to a cutting board and let them cool for 5 minutes (you don’t want the juices running out and leaving you with dry meat). Then chop the patties into a rough ½-inch dice.",
      "Preheat the oven to 250°F.",
      "Stack the tortillas, wrap them in aluminum foil, place them in the oven, and let them warm until they’re fragrant and pliable, about 15 minutes.",
      "Remove the tortillas from the oven. Unwrap the stack and line up the tortillas, assembly-line-style, on your work surface. Place the beef in a straight line down the center of each tortilla. Sprinkle a line of cheese over the beef, then top with onion, cilantro, cherry tomatoes, and bacon, and serve.",
      "In a medium bowl, toss the mushrooms with the marinade. Set them aside to marinate for 30 minutes.",
      "Set a large skillet over medium-high heat, add the olive oil, and heat until it is shimmering, 2 minutes. Working in batches (if you overcrowd the pan, they will steam instead of brown), cook the mushrooms, stirring often, until they are lightly browned, about 15 minutes per batch.",
      "Serve the mushrooms as tacos or bowls (recipes follow), or with all the fixings for Carne Asada Tacos ( this page ), or swap them in for the chicken on Pollo Frito Quesadillas ( this page ).",
      "Preheat the oven to 250°F.",
      "Stack the tortillas, wrap them in aluminum foil, place them in the oven, and let them warm until they’re fragrant and pliable, about 15 minutes.",
      "Remove the tortillas from the oven. Unwrap the stack and line up the tortillas, assembly-line-style, on your work surface.",
      "In a medium bowl, mix the shredded cabbage with the Salsa Verde. Spoon the mushrooms in a straight line down the center of each tortilla. Place a line of the cabbage mixture on top of the mushrooms, and top that with the pesto. Serve each taco with a lime wedge.",
      "In each individual serving bowl, arrange evenly divided portions of the rice, beans, corn, Pico de Gallo, lettuce, and Mushroom Asada in a clockwise pattern. Top with the Pepita Pesto."
    ],
    "images": [
      "../images/0750_Trej_9781984826855_art_r1.jpg",
      "../images/2007_Trej_9781984826855_art_r19.jpg",
      "../images/2005_Trej_9781984826855_art_r121.jpg",
      "../images/0778_Trej_9781984826855_art_r1.jpg",
      "../images/2007_Trej_9781984826855_art_r112.jpg"
    ],
    "source_file": "OEBPS/xhtml/c03.xhtml",
    "ingredient_count": 25,
    "step_count": 13,
    "image_count": 5
  },
  {
    "title": "Breakfast Burrito",
    "headnote": "We serve this all day long because it’s just that damned good. It has everything you want for breakfast, plus tater tots. It’s even better if you’ve got some leftover Carne Asada ( this page ) or Carnitas ( this page ).",
    "yield": "Makes 4 burritos",
    "ingredients": [
      "24 frozen tater tots",
      "1 tablespoon canola or vegetable oil",
      "8 large eggs, whisked",
      "Kosher salt",
      "Freshly ground black pepper",
      "4 13-inch flour tortillas",
      "½ cup shredded Mexican-style cheese blend, store-bought or homemade (see this page )",
      "1 cup Cheesy Bean Dip ( this page ), warmed",
      "4 bacon strips, cooked until crisp",
      "1 avocado, halved, pitted, peeled, and sliced (optional)",
      "½ cup Salsa Roja ( this page ) or store-bought fire-roasted tomato salsa, plus extra for serving",
      "½ cup tortilla strips (see this page ) or crumbled tortilla chips",
      "½ cup chopped fresh cilantro"
    ],
    "steps": [
      "Cook the tater tots according to the package directions. (We fry them to order at the restaurant; you can do that, or bake them—they’re almost just as good!)",
      "Heat the oil in a large pan set over medium heat. Add the eggs and season with salt and pepper. Using a fork (or a silicone spatula if you’re using a nonstick pan), constantly stir the eggs in a figure-eight pattern, taking care to scrape up any bits that are getting too firm or are sticking to the pan. Continue stirring the eggs until they are cooked through but still slightly wet, about 4 minutes. Season with a bit more salt and pepper. Set the pan of eggs aside.",
      "Place a tortilla in a large skillet set over medium heat, warming it until it is heated through and lightly browned in spots, about 1 minute. Turn the tortilla over and warm it on the second side, 1 minute more. Transfer the tortilla to a plate and cover it with a kitchen towel to keep it warm. Repeat with the remaining tortillas.",
      "Lay the tortillas out on your work surface. Sprinkle the cheese across the middle of each tortilla. Layer ¼ cup of the bean dip over the cheese and add 5 or 6 tater tots to the side. Add the eggs to the center, 1 strip of bacon to the side of the eggs, and a few slices of avocado, if using. Finish with the Salsa Roja, tortilla strips, and cilantro. Fold the left and right sides of each tortilla in by 1 inch. Grab the bottom of the tortilla and roll it away from you, ensuring the sides are tucked in. Serve with more Salsa Roja on the side."
    ],
    "images": [
      "../images/0744_Trej_9781984826855_art_r1.jpg"
    ],
    "source_file": "OEBPS/xhtml/c03.xhtml",
    "ingredient_count": 13,
    "step_count": 4,
    "image_count": 1
  },
  {
    "title": "Surf & Turf Burritos",
    "headnote": "Is a surf and turf burrito overkill? Perhaps, but in the best way possible. If you’ve got leftover asada , you’re living large, because you can just cook up some marinated shrimp to make the richest burrito we’ve got on the menu. You’ll notice this is a pretty elaborate setup, with nutty Pepita Pesto, fresh Pico de Gallo, spicy Salsa Roja, and black beans tucked inside the tortilla. If you want to make a shortcut version, you can ditch the homemade salsas and use store-bought fire-roasted tomato salsa, skip the rice and beans, and just cook up some plain shrimp because when you have steak and shrimp side by side, you can’t go wrong.",
    "yield": "Makes 4 burritos",
    "ingredients": [
      "1 tablespoon canola or vegetable oil",
      "12 marinated Spicy Diablo Shrimp ( this page ), or 12 medium shrimp, peeled and deveined",
      "1 garlic clove, chopped",
      "Kosher salt",
      "Freshly ground black pepper",
      "4 13-inch flour tortillas",
      "½ cup shredded Mexican-style cheese blend, store-bought or homemade (see this page )",
      "1 cup Spanish Rice ( this page ), warmed",
      "1 cup canned black beans, rinsed and drained, or Basic Black Beans ( this page ), warmed",
      "½ cup chopped Carne Asada ( this page ), warmed",
      "¼ cup Pepita Pesto ( this page )",
      "½ cup Pico de Gallo ( this page )",
      "Salsa Roja ( this page ), for serving"
    ],
    "steps": [
      "Heat the oil in a medium skillet set over medium heat until it is shimmering, about 2 minutes. Add the shrimp and garlic and cook, stirring often, until the garlic is fragrant and the shrimp is cooked through, about 5 minutes. Season to taste with salt and pepper. Transfer the shrimp to a cutting board and chop it into ½-inch pieces.",
      "Place a tortilla in a large skillet set over medium heat, warming it until it is heated through and lightly browned in spots, about 1 minute. Turn the tortilla over and warm it on the second side, 1 minute more. Transfer the tortilla to a plate and cover it with a kitchen towel to keep it warm. Repeat with the remaining tortillas.",
      "Lay the tortillas out on your work surface. Sprinkle 2 tablespoons of the cheese in a straight line across the middle of each tortilla. Layer ¼ cup of the rice, ¼ cup of the beans, 2 tablespoons of the Carne Asada, and ½ cup of the shrimp over the cheese. Top with the Pepita Pesto and Pico de Gallo. Fold the left and right sides of each tortilla in by 1 inch. Grab the bottom of the tortilla and roll it away from you, ensuring the sides are tucked in. Serve with Salsa Roja on the side."
    ],
    "images": [
      "../images/0908_Trej_9781984826855_art_r1.jpg"
    ],
    "source_file": "OEBPS/xhtml/c03.xhtml",
    "ingredient_count": 13,
    "step_count": 3,
    "image_count": 1
  },
  {
    "title": "Roasted Cauliflower Tacos",
    "headnote": "I never thought I’d see the day that cauliflower was put on a taco, but this is California, so why not? I was skeptical. And then I tasted what our chefs did with it. It’s unbelievably tender and tasty, and the cashew cream makes it rich and satisfying. This is the taco that the Los Angeles Times called one of their favorite recipes of 2017. It’s vegan! It’s delicious!",
    "yield": "Makes 8 tacos",
    "ingredients": [
      "1 medium head cauliflower",
      "2 tablespoons pure olive oil",
      "1 teaspoon kosher salt",
      "1 teaspoon freshly ground black pepper",
      "1 ear corn, shucked",
      "8 6-inch corn tortillas",
      "½ cup Vegan Cashew Crema ( this page )",
      "½ cup Pickled Red Onions ( this page )",
      "¼ cup chopped fresh cilantro"
    ],
    "steps": [
      "Roast the Cauliflower Preheat the oven to 375°F.",
      "Remove the cauliflower florets from the thick stem and break the florets into bite-sized pieces. Scatter the cauliflower florets on a rimmed 11 x 17-inch sheet pan, drizzle with the oil, season with the salt and pepper, and toss to coat. Roast the cauliflower until it is tender, about 30 minutes. Then raise the heat to 425°F and continue to cook until the cauliflower is lightly browned, about 10 minutes more. Set aside.",
      "Char the Corn While the cauliflower is cooking, turn a gas burner to high and place the ear of corn directly on the rack over the flame. (If you don’t have a gas oven, you can broil the corn.) Cook until the corn is charred in spots, turning it occasionally with tongs, about 2 minutes per side. Set the ear of corn aside to cool until you can handle it.",
      "In a medium mixing bowl, hold the ear of corn vertically and slice downward on each side to remove the kernels, letting them fall into the bowl. Discard the cob and use your hands to break the clumps of corn into separate kernels. Set aside.",
      "Make the Tacos Preheat the oven to 250°F.",
      "Stack the tortillas, wrap them in aluminum foil, place them in the oven, and let them warm until they’re fragrant and pliable, about 15 minutes.",
      "Remove the tortillas from the oven. Unwrap the stack and line up the tortillas, assembly-line-style, on your work surface.",
      "Spoon 1 tablespoon of the Vegan Cashew Crema in the center of each tortilla. Place several florets of roasted cauliflower on top of the crema and top them with some corn. Drizzle with more crema and garnish with the pickled onions and chopped cilantro."
    ],
    "images": [
      "../images/0748_Trej_9781984826855_art_r1.jpg"
    ],
    "source_file": "OEBPS/xhtml/c03.xhtml",
    "ingredient_count": 9,
    "step_count": 8,
    "image_count": 1
  },
  {
    "title": "Roasted Cauliflower Bowls",
    "headnote": "",
    "yield": "Makes 4 bowls",
    "ingredients": [
      "2 cups Spanish Rice ( this page ), warmed",
      "2 cups Basic Black Beans ( this page ), warmed",
      "2 cups grilled corn (see this page )",
      "1 cup Pico de Gallo ( this page )",
      "1 cup shredded romaine lettuce",
      "2 cups roasted cauliflower florets (see this page )",
      "½ cup Vegan Cashew Crema ( this page )",
      "¼ cup chopped red onion",
      "¼ cup chopped fresh cilantro",
      "½ cup Pickled Red Onions ( this page )"
    ],
    "steps": [
      "In each individual serving bowl, arrange evenly divided portions of the rice, beans, corn, Pico de Gallo, lettuce, and cauliflower in a clockwise pattern. Drizzle with the Vegan Cashew Crema. Garnish with the onion, cilantro, and pickled onions."
    ],
    "images": [],
    "source_file": "OEBPS/xhtml/c03.xhtml",
    "ingredient_count": 10,
    "step_count": 1,
    "image_count": 0
  },
  {
    "title": "BCR (BEAN, CHEESE & RICE) Burritos",
    "headnote": "This is the cheapest burrito on our menu, but it has tons of flavor thanks to the power of the Cheesy Bean Dip. We mix in some black beans to cut the richness just a little bit. It’s also vegetarian.",
    "yield": "Makes 4 burritos",
    "ingredients": [
      "4 13-inch flour tortillas",
      "1 cup Cheesy Bean Dip ( this page ), warmed",
      "1 cup shredded Mexican-style cheese blend, store-bought or homemade (see this page )",
      "1 cup Basic Black Beans ( this page ), warmed",
      "1 cup Spanish Rice ( this page ), warmed",
      "Salsa Roja ( this page ), for serving"
    ],
    "steps": [
      "Place a tortilla in a large skillet set over medium heat, warming it until it is heated through and lightly browned in spots, about 1 minute. Turn the tortilla over and warm it on the second side, 1 minute more. Transfer the tortilla to a plate and cover it with a kitchen towel to keep it warm. Repeat with the remaining tortillas.",
      "Lay the tortillas out on your work surface. Spread ¼ cup of the Cheesy Bean Dip in a straight line across the center of each tortilla. Layer ¼ cup of the cheese, ¼ cup of the black beans, and ¼ cup of the rice on top of the Cheesy Bean Dip. Fold the left and right sides of each tortilla in by 1 inch. Grab the bottom of the tortilla and roll it away from you, ensuring the sides are tucked in. Serve with Salsa Roja."
    ],
    "images": [],
    "source_file": "OEBPS/xhtml/c03.xhtml",
    "ingredient_count": 6,
    "step_count": 2,
    "image_count": 0
  },
  {
    "title": "Fried Avocado Tacos",
    "headnote": "Avocado toast has nothing on these tacos. Because you can’t fry avocado toast! The crunchy exterior and creamy inside of this taco is unexpectedly satisfying. It’s rich and, yes, vegetarian. So they’re good…but they’re fried. So they’re bad? The duality! This is another multistep frying project that pays off big-time.",
    "yield": "Makes 8 tacos",
    "ingredients": [
      "2 large eggs, beaten",
      "1½ cups panko bread crumbs",
      "1 cup rice flour",
      "2 avocados, halved, pitted,and peeled",
      "Kosher salt",
      "4 cups peanut oil",
      "8 6-inch corn tortillas",
      "1 cup Refried Black Beans ( this page ), warmed",
      "1 cup shredded romaine lettuce",
      "½ cup Salsa Verde ( this page )",
      "½ cup Pico de Gallo ( this page ),plus extra for garnish",
      "¼ cup finely chopped fresh cilantro"
    ],
    "steps": [
      "Bread and Fry the Avocados Set up your frying station: Add the eggs to a medium bowl, the panko to another, and the flour to a third. Slice each avocado half lengthwise into 8 pieces, and season the pieces with salt.",
      "In a large deep pot, heat the oil until it reaches 350°F on an instant-read thermometer.",
      "While the oil is heating, bread the avocado: Dredge the avocado slices in the flour first, shaking the excess back into the bowl. Then dip the slices in the egg, making sure to coat them completely and allowing the excess to drip back into the bowl. Finally dredge the avocado slices in the panko, pressing gently so it adheres. Place the breaded slices on a plate. (Use one hand for dredging and dipping to keep the other hand clean for other tasks.)",
      "Fry the avocado, 6 to 8 slices at a time (you don’t want to overcrowd the pot), in the hot oil, turning them occasionally, until they are golden brown and crisp, 3 to 4 minutes. Transfer the slices to a wire rack or a plate lined with paper towels to drain, and season them liberally with salt.",
      "Make the Tacos Preheat the oven to 250°F.",
      "Stack the tortillas, wrap them in aluminum foil, place them in the oven, and let them warm until they’re fragrant and pliable, about 15 minutes.",
      "Remove the tortillas from the oven. Unwrap the stack and line up the tortillas, assembly-line-style, on your work surface.",
      "On each of the tortillas, spread 2 tablespoons of the beans. Then top the beans with the lettuce, Salsa Verde, and Pico de Gallo. Place 4 pieces of avocado on top. Garnish with a little more Pico de Gallo and the cilantro."
    ],
    "images": [
      "../images/0762_Trej_9781984826855_art_r1.jpg"
    ],
    "source_file": "OEBPS/xhtml/c03.xhtml",
    "ingredient_count": 12,
    "step_count": 8,
    "image_count": 1
  },
  {
    "title": "Black Pepper Tofu Tacos",
    "headnote": "This vegan taco is rich, spicy, and intensely flavored with fresh ginger and fiery serrano chiles, which makes it as satisfying as any meat taco on our menu. Yes, it’s fried, which is part of the reason why it’s so damned good. Just because something’s vegan doesn’t mean it’s healthy (or boring)! The trick to getting the fragile tofu to hold together is to fry it in small batches and gently remove it from the oil using a frying spider or a fine-mesh sieve. Top the tofu with the sauce once it’s in the taco—or serve the tofu and sauce over steamed rice.",
    "yield": "Makes 12 tacos",
    "ingredients": [
      "1¾ pounds firm tofu (a little less than 2 14-ounce blocks)",
      "½ cup cornstarch",
      "2 cups plus 2 tablespoons canola oil",
      "8 medium shallots, halved and thinly sliced",
      "8 garlic cloves, finely chopped",
      "2 serrano chiles, stemmed and thinly sliced crosswise",
      "3 tablespoons finely chopped fresh ginger",
      "3 tablespoons chopped chipotles from a can of chipotle chiles in adobo sauce",
      "3 tablespoons low-sodium soy sauce",
      "2 tablespoons sugar",
      "2 tablespoons freshly ground black pepper",
      "1 teaspoon kosher salt",
      "3 scallions, finely chopped",
      "12 6-inch corn tortillas",
      "1 medium white onion, diced",
      "¼ cup finely chopped fresh cilantro",
      "1 cup Salsa Roja ( this page )"
    ],
    "steps": [
      "It’s important to get as much water out of the tofu as possible before cooking it. To do this, place the tofu on a plate and then balance another plate on top and weight it down with any canned food you have in your cupboard (a big can of tomatoes works well). Let it sit for 30 minutes or so, occasionally draining off the water that the tofu releases. Pat the tofu dry with a paper towel, and dice it into 1-inch cubes.",
      "Set up your frying station: Place the cornstarch in a medium bowl. Line a large plate with paper towels.",
      "Heat 2 cups of the oil in a large deep saucepan over medium heat until the oil reaches 350°F on an instant-read thermometer. Add about one-third of the tofu to the cornstarch and use a fork to turn it in the cornstarch, making sure it’s well coated on all sides. Add the cornstarch-coated tofu to the hot oil and fry until it is lightly browned all over, using a frying spider or slotted spoon to turn it occasionally, about 3 minutes per side. Transfer the tofu to the plate lined with paper towels to drain. Repeat with the remaining tofu in two more batches.",
      "Heat the remaining 2 tablespoons oil in a large skillet over medium-high heat until it is shimmering. Add the shallots, garlic, serrano chiles, and ginger and cook, stirring often, until they are soft and slightly caramelized, 7 to 10 minutes. Stir in the chipotle chiles, soy sauce, sugar, pepper, and salt. Add the tofu to the skillet and cook, stirring gently, until it is warmed through, about 2 minutes. Add the scallions and gently fold them in, taking care to not break up the tofu. Set aside.",
      "Preheat the oven to 250°F.",
      "Wrap the tortillas in aluminum foil, place them in the oven, and let them warm until they’re fragrant and pliable, about 15 minutes.",
      "Remove the tortillas from the oven. Unwrap the stack and line up the tortillas, assembly-line-style, on your work surface. Divide the tofu evenly among the tortillas and top it with the onion and cilantro. Serve with the Salsa Roja on the side."
    ],
    "images": [],
    "source_file": "OEBPS/xhtml/c03.xhtml",
    "ingredient_count": 17,
    "step_count": 7,
    "image_count": 0
  },
  {
    "title": "Killer Quesadillas",
    "headnote": "It might seem ridiculous to offer recipes for something as simple as a quesadilla, but they’re one of the most popular items on our menu, so we have to be doing something right. When my kids were little I’d just throw quesadillas together without really thinking about it, but at the restaurants ours are consistently delicious because of the proportion of cheese (1 cup for each tortilla is just cheesy enough), the method (pan-toasting both sides of the tortilla), and the fillings and sauces (we pair meats, cremas, and salsas with the same care as we do for our tacos). This “killer” quesadilla is the house recipe we use as the foundation and then add whatever protein is asked for, be it steak, grilled chicken, spicy shrimp, or carnitas. The quesadillas that follow on this page and this page are more “specialty” quesadillas, but honestly, it’s tough to beat the simple pleasures of melty cheese in a toasty tortilla. This recipe makes two quesadillas but can easily be doubled. If you’re making more than two quesadillas, preheat your oven to 250°F to keep the first quesadillas warm while you finish the others.",
    "yield": "Makes 2 quesadillas",
    "ingredients": [
      "2 13-inch flour tortillas",
      "2 cups shredded Mexican-style cheese blend, store-bought or homemade (see this page )",
      "Optional additions: 1½ cups chopped Carne Asada ( this page ), Trejo’s Grilled Chicken ( this page ), Grilled Spicy Diablo Shrimp ( this page ), or Carnitas ( this page )",
      "½ cup Salsa Roja ( this page )"
    ],
    "steps": [
      "Heat a large pan or cast-iron skillet over medium-high heat for 2 minutes. Place a tortilla in the pan and cook until it is lightly browned, about 30 seconds. Turn the tortilla over, spread 1 cup of the cheese evenly across the tortilla, then spread half of your choice of protein, if using, across the tortilla, and cook until the cheese begins to melt, about 3 minutes.",
      "Fold the tortilla in half and cook for 45 seconds. Turn the quesadilla over and cook for another 45 seconds. Transfer it to a cutting board and slice it into 4 wedges.",
      "Repeat with the remaining tortilla and fillings. Serve with Salsa Roja on the side."
    ],
    "images": [
      "../images/0784_Trej_9781984826855_art_r1.jpg"
    ],
    "source_file": "OEBPS/xhtml/c03.xhtml",
    "ingredient_count": 4,
    "step_count": 3,
    "image_count": 1
  },
  {
    "title": "Chicken Tikka Quesadillas",
    "headnote": "This quesadilla is a good reason to make a double batch of Chicken Tikka: serve chicken tikka bowls or tacos for dinner one night and have these quesadillas for lunch the next day. The quesadillas get an extra hit of freshness from a mixture of Pico de Gallo and white onion, and we serve it with an escabeche-mint cream on the side—both of which you will have made for the tacos already.",
    "yield": "Makes 2 quesadillas",
    "ingredients": [
      "¼ cup Pico de Gallo ( this page )",
      "¼ medium white onion, chopped",
      "2 13-inch flour tortillas",
      "2 cups shredded Mexican-style cheese blend, store-bought or homemade (see this page )",
      "1½ cups chopped cooked Chicken Tikka (about one-third of the recipe on this page )",
      "1 cup Escabeche-Mint Crema ( this page )"
    ],
    "steps": [
      "In a small bowl, combine the Pico de Gallo and onion and mix well.",
      "Heat a large pan or cast-iron skillet over medium-high heat. Place a tortilla in the pan and cook until it is lightly browned, about 30 seconds. Turn the tortilla over and spread 1 cup of the cheese evenly over the top. Sprinkle the Chicken Tikka over the cheese, then spoon the Pico/onion mixture over the chicken. Cook until the cheese begins to melt, about 3 minutes.",
      "Fold the tortilla in half and cook for 45 seconds, then turn the quesadilla over and cook for another 45 seconds on the other side. Transfer the quesadilla to a cutting board and cut it into 4 wedges.",
      "Repeat with the remaining tortilla and fillings. Serve with the Escabeche-Mint Crema on the side."
    ],
    "images": [],
    "source_file": "OEBPS/xhtml/c03.xhtml",
    "ingredient_count": 6,
    "step_count": 4,
    "image_count": 0
  },
  {
    "title": "pollo frito Quesadillas",
    "headnote": "Our fried chicken is killer, and when you add cheesy-toasty-tortilla goodness to it in a quesadilla format, it becomes even more satisfying. If you’ve got any leftover takeout fried chicken, now you know what to do with it.",
    "yield": "Makes 2 quesadillas",
    "ingredients": [
      "½ cup shredded green cabbage",
      "½ cup Chipotle Crema ( this page )",
      "2 13-inch flour tortillas",
      "2 cups shredded Mexican-style cheese blend, store-bought or homemade (see this page )",
      "1½ cups chopped Trejo’s Fried Chicken (about one-third of the recipe on this page )",
      "2 serrano chiles, finely chopped"
    ],
    "steps": [
      "In a medium bowl, combine the cabbage and ¼ cup of the Chipotle Crema and mix well.",
      "Heat a large pan or cast-iron skillet over medium-high heat. Place a tortilla in the pan and cook until it is lightly browned, about 30 seconds. Turn the tortilla over and spread 1 cup of the cheese evenly across the top, then add ¾ cup of the fried chicken evenly across the tortilla. Sprinkle half of the cabbage mixture over the chicken and then sprinkle half of the serranos evenly on top. Cook until the cheese begins to melt, about 3 minutes.",
      "Fold the tortilla in half and cook for 45 seconds, then turn the quesadilla over and cook for another 45 seconds. Transfer the quesadilla to a cutting board and cut it into 4 wedges.",
      "Repeat with the remaining tortilla and fillings. Serve with the remaining Chipotle Crema on the side."
    ],
    "images": [],
    "source_file": "OEBPS/xhtml/c03.xhtml",
    "ingredient_count": 6,
    "step_count": 4,
    "image_count": 0
  },
  {
    "title": "Guacamole",
    "headnote": "Our guacamole is special because it’s got so much more going on than your usual guac. Instead of smashing the avocados, we push them through a checkered wire rack that chefs usually use to cool baked goods. This cubes the avocados without mashing them too much, and then we add pistachios for extra crunch and a little nutty taste. We don’t expect you to go out and buy a wire rack, so we’ve modified this recipe to achieve a similar result. Alongside, we serve chips made by Angeleno tortilla company La Fortaleza. At Trejo’s we make a point to support locally owned businesses, so while it might be easy to buy some big-name brand at a supermarket, we suggest you try to find a local tortilla chip maker and keep your money in the community.",
    "yield": "Serves 6",
    "ingredients": [
      "3 ripe medium avocados, halved and pitted",
      "½ small white onion, finely chopped",
      "½ serrano or jalapeño chile, finely chopped",
      "4 tablespoons chopped fresh cilantro",
      "Juice of 1 lime, plus extra to taste",
      "1 tablespoon pure olive oil",
      "1 teaspoon kosher salt, plus extra to taste",
      "2 tablespoons chopped salted roasted pistachios"
    ],
    "steps": [
      "Use a spoon to scoop half of the avocado flesh into a medium bowl. Smash the avocado with a fork or a potato masher until it is mostly smooth.",
      "In a separate medium bowl, lightly mash the remaining avocado so that it’s more chunky than smooth. Add the smashed avocado, onion, chile, 2 tablespoons of the cilantro, and the lime juice, olive oil, and salt, and gently fold to combine. Taste and add more lime juice or salt if desired. Serve the guacamole sprinkled with the pistachios and the remaining 2 tablespoons cilantro."
    ],
    "images": [
      "../images/0767_Trej_9781984826855_art_r1.jpg"
    ],
    "source_file": "OEBPS/xhtml/c04.xhtml",
    "ingredient_count": 8,
    "step_count": 2,
    "image_count": 1
  },
  {
    "title": "Shrimp & Scallop Ceviche",
    "headnote": "Many people are intimidated by the idea of making ceviche at home, but it’s incredibly easy, as long as you’re cool with squeezing a bunch of citrus! You could use a hinged squeezer and give your forearms a workout, but if you have an electric juicer, this is the time to break it out. One batch of the citrus juice “cooks” the seafood with its acidity, while more juice is added to the aquachile dressing to finish the ceviche with a second layer of fresh flavor.",
    "yield": "Serves 6",
    "ingredients": [
      "Ceviche",
      "1 pound large shrimp, peeled, deveined, and chopped into ½-inch pieces",
      "½ pound bay scallops",
      "2 cups fresh lime juice (from about 12 to 14 limes)",
      "Aguachile Dressing",
      "2 scallions, white and green parts, chopped",
      "1 Persian cucumber, roughly chopped",
      "1 jalapeño, roughly chopped",
      "¾ cup roughly chopped fresh cilantro",
      "½ medium serrano chile, roughly chopped",
      "¼ cup roughly chopped fresh flat-leaf parsley",
      "⅓ cup lemon juice (from about 3 lemons)",
      "¼ cup lime juice (from about 2 limes)",
      "1 teaspoon kosher salt",
      "Garnish",
      "½ medium red onion, diced",
      "1 small Persian cucumber, diced",
      "¼ cup diced grilled pineapple (see this page ; optional)",
      "3 tablespoons Pico de Gallo ( this page )",
      "1 tablespoon chopped fresh cilantro"
    ],
    "steps": [
      "“Cook” the Ceviche In a large bowl, combine the shrimp, scallops, and lime juice. Cover the bowl with plastic wrap and refrigerate for 3 hours.",
      "Make the Aguachile Dressing Put the scallions, cucumber, jalapeño, cilantro, serrano, parsley, lemon juice, lime juice, and salt in a blender and blend until smooth.",
      "Finish the Ceviche When the shrimp and scallops are done “cooking” (they will firm up and turn from translucent to white), drain them and return them to the bowl. Add the aguachile dressing, and mix together.",
      "Transfer the ceviche to a serving platter and garnish it with the diced onion, cucumber, pineapple, if using, Pico de Gallo, and cilantro."
    ],
    "images": [
      "../images/0749_Trej_9781984826855_art_r1.jpg"
    ],
    "source_file": "OEBPS/xhtml/c04.xhtml",
    "ingredient_count": 20,
    "step_count": 4,
    "image_count": 1
  },
  {
    "title": "Trejo’s Chicken Wings with Blue Cheese Dip",
    "headnote": "These wings have a lot in common with Buffalo wings, except you don’t have to fry them and you use a good old Mexican hot sauce instead of the traditional Frank’s Hot Sauce that they use in New York. Not frying means you’ve got more time to watch the game and don’t have to worry about one of your friends knocking the hot oil all over the place when your team scores. Make the dip a day or two before the game so you’ll have it ready when the wings come out of the oven.",
    "yield": "Serves 4 to 6 (makes 2 cups dip)",
    "ingredients": [
      "Wings",
      "1 tablespoon baking powder",
      "1 teaspoon garlic powder",
      "1 teaspoon onion powder",
      "1 teaspoon cayenne pepper",
      "1 teaspoon paprika",
      "2 pounds chicken wings (about 20 pieces), cut into drumettes and flats, patted dry with paper towels",
      "1 tablespoon canola oil",
      "4 tablespoons (½ stick) unsalted butter, melted",
      "2 tablespoons hot sauce, such as Trejo’s, Tapatío, or Cholula",
      "Blue Cheese Dip",
      "1 cup crumbled blue cheese",
      "½ cup sour cream",
      "¼ cup mayonnaise",
      "Juice of ½ lemon",
      "1 tablespoon whole milk or buttermilk",
      "1 small garlic clove, chopped",
      "Kosher salt",
      "Freshly ground black pepper"
    ],
    "steps": [
      "Roast the Wings Preheat the oven to 400°F.",
      "In a large bowl, combine the baking powder, garlic powder, onion powder, cayenne, and paprika. Add the wings and stir to coat them.",
      "Line an 11 x 17-inch sheet pan with aluminum foil. Use the canola oil to grease the foil and then turn the wings out onto the pan. Roast the wings until they’re golden brown, about 45 minutes.",
      "Make the Dip In a medium bowl, whisk together the blue cheese, sour cream, mayonnaise, lemon juice, milk, garlic, and a few pinches each of salt and pepper. Stir to combine, then taste and add more salt or pepper if needed. Serve immediately, or cover the bowl with plastic wrap and refrigerate it for up to 3 days.",
      "Sauce the Wings In a small bowl, whisk together the melted butter and the hot sauce. As soon as the wings come out of the oven, pour the spicy butter sauce over them and toss to coat. Serve with the blue cheese dip."
    ],
    "images": [
      "../images/0754_Trej_9781984826855_art_r1.jpg"
    ],
    "source_file": "OEBPS/xhtml/c04.xhtml",
    "ingredient_count": 19,
    "step_count": 5,
    "image_count": 1
  },
  {
    "title": "Nachos",
    "headnote": "The difference between a good plate of nachos and a great plate of nachos is the placement of all the ingredients. You want to make sure you get everything evenly spread out in and around and on each chip, so every bite’s got the melty cheese, a bit of jalapeño, some beans, and some of our killer Chipotle Crema.",
    "yield": "Serves 4",
    "ingredients": [
      "4 cups tortilla chips",
      "1 cup shredded Mexican-style cheese blend, store-bought or homemade (see this page )",
      "1 cup canned black or pinto beans, drained and rinsed, or 1 cup leftover Basic Black Beans ( this page ), warmed",
      "1 cup Pico de Gallo ( this page )",
      "¼ cup Chipotle Crema ( this page )",
      "½ cup Escabeche ( this page ) or canned pickled jalapeños, drained",
      "2 tablespoons crumbled Cotija cheese",
      "2 tablespoons finely chopped fresh cilantro"
    ],
    "steps": [
      "Preheat the oven to 350°F.",
      "Scatter the tortilla chips on a sheet pan and sprinkle them evenly with the shredded cheese, making sure each chip has some cheese on it. Bake until the cheese is melted, 3 to 5 minutes.",
      "Top the chips with the beans and Pico de Gallo. Drizzle with the Chipotle Crema. Sprinkle the Escabeche over the chips, followed by the Cotija and cilantro, and serve."
    ],
    "images": [
      "../images/0780_Trej_9781984826855_art_r11.jpg"
    ],
    "source_file": "OEBPS/xhtml/c04.xhtml",
    "ingredient_count": 8,
    "step_count": 3,
    "image_count": 1
  },
  {
    "title": "Fajitas",
    "headnote": "Fajitas aren’t an L.A. dish, but we included them on our menu because sometimes people don’t want superspicy Mexican food. This dish has its roots in Texas, where gauchos would cook up beef with whatever vegetables were handy. Our version isn’t fancy, but it’s a satisfying throwback to a dish that’s not as trendy as it used to be. Use whatever protein you want. If you don’t serve it with rice or tortillas, it’s technically paleo, which appeals to the bodybuilder in me.",
    "yield": "Serves 4",
    "ingredients": [
      "3 tablespoons pure olive oil",
      "1 large white onion, halved lengthwise and thinly sliced",
      "1 red bell pepper, halved, seeded, and sliced into thin strips",
      "1 yellow bell pepper, halved, seeded, and sliced into thin strips",
      "2 poblano peppers, halved, seeded, and sliced into thin strips",
      "Kosher salt",
      "Freshly ground black pepper",
      "1½ pounds protein of your choice (skirt steak; boneless, skinless chicken thighs or breasts; peeled and deveined medium shrimp; tofu)",
      "3 garlic cloves, minced",
      "1 lime, cut into 4 wedges",
      "8 10-inch flour tortillas, warmed (see this page )",
      "Store-bought roasted tomato salsa or salsa verde, or homemade Salsa Roja ( this page ) or Salsa Verde ( this page ), for serving"
    ],
    "steps": [
      "In a cast-iron skillet, heat 2 tablespoons of the oil over high heat. Add the onion and the red, yellow, and poblano peppers. Season with salt and pepper and cook, stirring often, until the vegetables are soft and lightly browned in spots, about 7 minutes. Transfer them to a plate and set aside.",
      "Add the remaining 1 tablespoon oil, along with the protein and garlic to the skillet, and cook until the protein is browned and cooked through on both sides: 3 minutes per side for skirt steak; 5 minutes per side for chicken breasts; 8 minutes per side for chicken thighs; 2 minutes per side for shrimp; 3 minutes per side for tofu. If you are using steak or chicken, transfer it to a cutting board and let it rest for 5 minutes before slicing it crosswise into thin strips. Reserve the skillet.",
      "Return the vegetable mixture to the skillet and reheat it over high heat, tossing it with the juices in the skillet. Divide the mixture among individual plates and top it with the protein. Serve with the lime wedges, warm tortillas, and your favorite salsa."
    ],
    "images": [],
    "source_file": "OEBPS/xhtml/c04.xhtml",
    "ingredient_count": 12,
    "step_count": 3,
    "image_count": 0
  },
  {
    "title": "el jefe Salad",
    "headnote": "This chopped salad is pretty much the opposite of nachos on the healthy spectrum. But it’s still crunchy, bright, and satisfying. Top the salad with any of the proteins in this book and you’ve got yourself a meal.",
    "yield": "Serves 4",
    "ingredients": [
      "3 tablespoons pure olive oil",
      "Juice of 1 lemon",
      "Juice of ½ lime",
      "Kosher salt",
      "Freshly ground black pepper",
      "4 medium leaves Tuscan black kale, stems removed, leaves finely chopped (about 1 cup)",
      "1 small head romaine lettuce, very thinly sliced (about 4 cups)",
      "½ cup roasted corn (see this page )",
      "½ cup canned black beans, drained and rinsed, or ½ cup Basic Black Beans ( this page )",
      "½ cup quartered cherry tomatoes",
      "¼ cup crumbled Cotija cheese",
      "¼ cup Guacamole ( this page )",
      "1 cup grilled shrimp, chicken, asada , or carnitas (optional)",
      "½ cup tortilla strips (see this page )"
    ],
    "steps": [
      "In a large bowl, whisk together the olive oil, lemon and lime juices, and salt and pepper to taste until combined. Add the kale and the lettuce, and toss the greens with the vinaigrette. Top with the corn, black beans, cherry tomatoes, and Cotija.",
      "Place the guacamole on one side of the bowl and the protein, if using, across from it. Garnish with the tortilla strips and serve."
    ],
    "images": [],
    "source_file": "OEBPS/xhtml/c04.xhtml",
    "ingredient_count": 14,
    "step_count": 2,
    "image_count": 0
  },
  {
    "title": "Kale Salad",
    "headnote": "I’m not ashamed to say I eat kale salad. In fact, I’ve appeared on national TV eating kale salad in an episode of the late and great Anthony Bourdain’s Parts Unknown ! Kale is sturdy enough that it won’t wilt over time, making this an excellent salad to put together in advance for a party.",
    "yield": "Serves 4",
    "ingredients": [
      "2 medium bunches Tuscan kale, tough stems removed and leaves sliced into thin ribbons (6 cups)",
      "½ small cucumber, diced",
      "½ small red bell pepper, diced",
      "½ cup canned black beans, drained and rinsed, or ½ cup Basic Black Beans ( this page )",
      "½ cup halved cherry tomatoes",
      "½ cup roasted corn (see sidebar, following)",
      "1 teaspoon kosher salt",
      "¼ cup Creamy Cilantro-Lime Vinaigrette ( this page )",
      "2 tablespoons toasted pepitas",
      "1 lemon, cut into 4 wedges"
    ],
    "steps": [
      "In a medium bowl, toss together the kale, cucumber, bell pepper, black beans, tomatoes, corn, and salt. Add the vinaigrette and mix well to combine. Divide the salad among individual bowls and sprinkle with the pepitas. Serve with the lemon wedges on the side."
    ],
    "images": [
      "../images/0770_Trej_9781984826855_art_r1.jpg"
    ],
    "source_file": "OEBPS/xhtml/c04.xhtml",
    "ingredient_count": 10,
    "step_count": 1,
    "image_count": 1
  },
  {
    "title": "Roasted Brussels Sprouts",
    "headnote": "When I was growing up, nobody liked to eat their brussels sprouts, so I was skeptical when the chefs wanted to put sprouts on the menu at Trejo’s. I’ve since learned that back in the day, nobody knew how to cook them. People used to boil them too long, which made them taste like sulfur. But then somebody figured out that you should roast the heck out of them, caramelize them, and make them toasty and tender. And now everybody loves them, including me. We deep-fry the brussels sprouts at the restaurant, which is insanely delicious but scary as hell. Roasting is healthier and way less scary. The red chimichurri is different from the usual green version, thanks to smoked paprika and chipotle chili. It’s spicy, tangy, and smoky and is great on broccoli and cauliflower and all those other vegetables we used to hate but now love when they’re roasted the right way.",
    "yield": "Serves 4 (makes ¾ cup chimichurri)",
    "ingredients": [
      "Brussels Sprouts",
      "1½ pounds brussels sprouts, stem ends trimmed, halved lengthwise",
      "¼ cup pure olive oil",
      "1 teaspoon kosher salt",
      "1 teaspoon freshly ground black pepper",
      "Red Chimichurri",
      "½ cup extra-virgin olive oil",
      "¼ cup red wine vinegar",
      "3 garlic cloves, finely chopped",
      "1 chipotle chile from a can of chipotle chiles in adobo sauce, chopped (about 1 tablespoon)",
      "1 teaspoon smoked paprika",
      "Kosher salt",
      "Freshly ground black pepper",
      "1 cup finely chopped fresh flat-leaf parsley",
      "2 tablespoons finely chopped fresh cilantro"
    ],
    "steps": [
      "Roast the Brussels Sprouts Preheat the oven to 450°F.",
      "Scatter the brussels sprouts on a rimmed 11 x 17-inch sheet pan and add the oil, salt, and pepper. Toss to coat. Roast the brussels sprouts until they are tender and brown, 20 to 25 minutes.",
      "Make the Red Chimichurri In a large bowl, whisk together the olive oil, vinegar, garlic, chipotle chile, paprika, and salt and pepper to taste. Add the parsley and cilantro and stir to combine.",
      "Add the roasted brussels sprouts to the chimichurri and toss to coat. Transfer the sprouts to a platter and serve."
    ],
    "images": [
      "../images/0745_Trej_9781984826855_art_r1.jpg"
    ],
    "source_file": "OEBPS/xhtml/c04.xhtml",
    "ingredient_count": 15,
    "step_count": 4,
    "image_count": 1
  },
  {
    "title": "Street Corn on the Cob (Elote)",
    "headnote": "On street corners throughout L.A., you’ll find pushcarts where you can buy elote on a stick for 2 bucks. We swap out the mayo a lot of the vendors use for our Chipotle Crema, which makes ours just a little more artisanal…but it’s still just as satisfying.",
    "yield": "Makes 6 pieces",
    "ingredients": [
      "3 ears corn, husked",
      "1 cup crumbled Cotija cheese",
      "1½ cups Chipotle Crema ( this page )",
      "Tajín seasoning (see Trejo’s Tip, this page )",
      "Ground red chile powder to taste",
      "1 cup finely chopped fresh cilantro"
    ],
    "steps": [
      "Cook the corn in a large pot of boiling water until it’s tender, 5 to 7 minutes. Drain the corn and place the ears on a cutting board. Cut the ears in half.",
      "Place the Cotija on a plate. Using a rubber or silicone spatula, spread the Chipotle Crema over all sides of the pieces of corn. Then roll the corn in the Cotija cheese to coat it completely. Sprinkle with Tajín and chile powder to taste. Serve sprinkled with the cilantro."
    ],
    "images": [
      "../images/0760_Trej_9781984826855_art_r1.jpg"
    ],
    "source_file": "OEBPS/xhtml/c04.xhtml",
    "ingredient_count": 6,
    "step_count": 2,
    "image_count": 1
  },
  {
    "title": "Street Corn in a Bowl",
    "headnote": "This dish has all the flavors of elote but involves more vegetables and a little less Chipotle Crema, making it a bit healthier. The sprinkling of popcorn is a fun way of adding flavor and some crunchy texture without too much fat.",
    "yield": "Serves 2 (4 pieces)",
    "ingredients": [
      "2 large ears corn, husked",
      "2 tablespoons Chipotle Crema ( this page )",
      "6 scallions, white and light green parts, thinly sliced",
      "½ cup finely chopped fresh cilantro, plus more for serving",
      "½ serrano chile, thinly sliced",
      "1 garlic clove, minced",
      "Juice of 1 lime",
      "1 cup freshly popped popcorn",
      "¼ cup crumbled Cotija cheese"
    ],
    "steps": [
      "Heat a gas or charcoal grill to medium heat.",
      "Grill the husked corn, turning the ears every few minutes, until the kernels are blistered and the color has gone from pale to bright yellow. Let the corn cool, and then slice the kernels off the cobs.",
      "In a medium bowl, combine the grilled corn, Chipotle Crema, scallions, cilantro, serrano, garlic, and lime juice and mix well. Transfer the salad to a serving bowl and sprinkle with the popcorn, Cotija, and more cilantro."
    ],
    "images": [],
    "source_file": "OEBPS/xhtml/c04.xhtml",
    "ingredient_count": 9,
    "step_count": 3,
    "image_count": 0
  },
  {
    "title": "Cotija & Chile Mashed Potatoes",
    "headnote": "You don’t think of mashed potatoes when you think of Mexican food, but the roasted chiles and Cotija cheese make these a good match for the flavors of other dishes in this book. These potatoes are rich, creamy, and indulgent and go well with a steak and Trejo’s Steak Sauce ( this page ) or alongside barbacoa or carnitas .",
    "yield": "Serves 6",
    "ingredients": [
      "2 medium poblano chiles",
      "2 pounds Yukon Gold potatoes, scrubbed (leave the skin on) and quartered",
      "2 cups whole milk",
      "1 teaspoon kosher salt",
      "1 teaspoon freshly ground black pepper",
      "8 tablespoons (1 stick) unsalted butter, melted",
      "3 tablespoons crumbled Cotija cheese",
      "½ cup shredded Mexican-style cheese blend, store-bought or homemade (see this page )"
    ],
    "steps": [
      "Place the chiles directly over a gas burner turned to medium-high and cook, turning them occasionally with tongs, until they are blistered on all sides, about 5 minutes. Let the chiles cool and then scrape off the blackened outer layer with a spoon. Cut off the stems, slice the chiles lengthwise, remove the seeds, and coarsely chop the chiles. You should have about ½ cup. Set aside.",
      "Put the potatoes in a medium saucepan and add cold water to cover. Bring the water to a simmer over high heat, then reduce the heat to medium-low and cook until the potatoes are tender throughout, about 20 minutes. Drain the potatoes and set them aside to cool slightly.",
      "In the same saucepan used for the potatoes, combine the milk, salt, and pepper. Set the pan over medium heat. When the milk is just hot enough that you can see steam rising, return the potatoes to the pan and use a potato masher to combine them with the milk, taking care not to overmix.",
      "Gently stir in the melted butter, and then stir in half of the Cotija, half of the cheese blend, and half of the chopped chiles. Gently mix again.",
      "Use a rubber spatula to transfer the mashed potatoes to a serving dish. Sprinkle with the remaining Cotija, cheese blend, and chiles and serve."
    ],
    "images": [
      "../images/0774_Trej_9781984826855_art_r1.jpg",
      "../images/0786_Trej_9781984826855_art_r1.jpg"
    ],
    "source_file": "OEBPS/xhtml/c04.xhtml",
    "ingredient_count": 8,
    "step_count": 5,
    "image_count": 2
  },
  {
    "title": "Basic Black Beans",
    "headnote": "If you think canned beans are cheap, then wait until you see how far a bag of dried beans can go! With a pound of dried beans that costs a few bucks, you can make enough cooked beans to serve 12 people (or more!), easy. Dried beans tend to have a meatier texture when cooked and will fully soak up the flavors of the ingredients you cook with them. The longer you soak the beans before cooking, the creamier they will get.",
    "yield": "Makes 6 cups",
    "ingredients": [
      "1 pound dried black beans",
      "2 tablespoons pure olive oil",
      "½ medium yellow or white onion, chopped",
      "2 medium carrots, chopped",
      "1 celery stalk, chopped",
      "½ medium jalapeño, chopped",
      "2 garlic cloves, chopped",
      "1 dried chile de árbol",
      "2 teaspoons ground cumin",
      "1 teaspoon dried oregano",
      "½ cinnamon stick, about 1 inch long",
      "1 dried bay leaf",
      "Kosher salt",
      "1 teaspoon freshly ground black pepper, plus extra to taste"
    ],
    "steps": [
      "Place the beans in a large bowl and add enough tepid water to cover them by at least 2 inches. Set aside to soak at room temperature for at least 3 hours and up to overnight.",
      "Heat the oil in a large pot over medium heat until the oil is shimmering but not smoking, about 2 minutes. Add the onion, carrots, celery, jalapeño, and garlic and cook, stirring occasionally, until the vegetables are soft but not browned, 7 to 10 minutes. Drain the beans and add them to the pot along with the chile de árbol, cumin, oregano, cinnamon stick, bay leaf, and salt and pepper. Add cold water to cover the beans by at least 2 inches. Raise the heat to high, bring the water to a boil, then reduce the heat to medium-low and simmer until the beans are tender, adding water if necessary, 45 minutes to 1 hour.",
      "Taste and add more salt and pepper if necessary. Remove and discard the bay leaf, chile de árbol, and cinnamon stick before serving. You can refrigerate the beans in an airtight container for up to 3 days."
    ],
    "images": [],
    "source_file": "OEBPS/xhtml/c04.xhtml",
    "ingredient_count": 14,
    "step_count": 3,
    "image_count": 0
  },
  {
    "title": "Spanish Rice",
    "headnote": "Spanish rice, stained yellowish-pink by tomatoes, is a standard side dish in Mexican restaurants across the country. No Combo Platter #3 would be complete without this rice sitting next to some refried beans and whatever else you ordered. We step it up a bit with chile de árbol and organic basmati rice. It’s a great burrito filling and a satisfying side to any of the proteins in this book.",
    "yield": "Serves 4 to 6",
    "ingredients": [
      "¼ cup plus 2 tablespoons pure olive oil",
      "½ medium white onion, diced",
      "3 garlic cloves, minced",
      "1½ teaspoons kosher salt, plus extra to taste",
      "2 cups basmati rice (preferably organic)",
      "1 cup canned diced tomatoes, with their juices",
      "1 dried chile de árbol",
      "1 dried bay leaf"
    ],
    "steps": [
      "In a large saucepan, heat ¼ cup of the oil over medium heat until it is shimmering, about 3 minutes. Add the onion and garlic and cook, stirring occasionally, until the onion is translucent, about 5 minutes. Stir in the salt, and then add the basmati rice and toast it, stirring occasionally, until the rice is fragrant, about 5 minutes.",
      "Add 2 cups of water, the tomatoes, the chile de árbol, and the bay leaf and raise the heat to high. Bring the liquid to a boil, then reduce the heat to low. Cover the saucepan and cook the rice for 20 minutes. Turn off the heat and set the pan aside, covered, for 5 minutes.",
      "Uncover the pan, add the remaining 2 tablespoons olive oil, and fluff the rice with a fork. Remove chile and bay leaf. Taste and add more salt if needed."
    ],
    "images": [],
    "source_file": "OEBPS/xhtml/c04.xhtml",
    "ingredient_count": 8,
    "step_count": 3,
    "image_count": 0
  },
  {
    "title": "Brown Basmati Rice",
    "headnote": "When we first opened, this was the rice we served. It has so many spices and so much flavor that by serving it, you’re halfway to a healthy meal. As a restaurateur, though, if people don’t order it, it isn’t worth keeping on the menu, and for whatever reason, everyone requested white or Spanish rice, so we took our healthy brown basmati off the menu. We include it here because it was a staff favorite, and I just know some extremely health-conscious cooks will be extra-happy to have this recipe—this one’s for you guys.",
    "yield": "Serves 6",
    "ingredients": [
      "2 tablespoons pure olive oil",
      "1 dried chile de árbol",
      "1 tablespoon cumin seeds",
      "½ medium yellow onion, diced",
      "2 garlic cloves, chopped",
      "2 cups brown basmati rice, preferably organic",
      "1 dried bay leaf",
      "2 cups full-fat coconut milk",
      "½ cinnamon stick, about 1 inch"
    ],
    "steps": [
      "In a medium pot, heat the olive oil over medium-high heat until it is smoking, about 3 minutes. Add the chile and the cumin seeds and toast, stirring often, until they are fragrant, 5 to 10 seconds. Add the onion and cook, stirring often, until it is soft, about 7 minutes. Add the garlic, cook for 1 minute, and then add the rice and bay leaf. Toast the rice, stirring it often, until it smells toasted and becomes opaque, about 5 minutes.",
      "Add 2 cups of water, the coconut milk, and the cinnamon stick and bring the liquid to a boil. Then reduce the heat to low, cover the pot, and simmer for 25 minutes. Remove the pan from the heat and let the rice sit, still covered, for 15 minutes before uncovering and fluffing it with a fork. Discard the chile, bay leaf, and cinnamon stick before serving."
    ],
    "images": [],
    "source_file": "OEBPS/xhtml/c04.xhtml",
    "ingredient_count": 9,
    "step_count": 2,
    "image_count": 0
  },
  {
    "title": "Refried Black Beans",
    "headnote": "This may be the best bang for the buck dish in the entire cookbook. You can used canned beans and make this in about 20 minutes flat and feast for cheap. It’s one of those rare dishes that’s incredibly hearty and satisfying but still good for you.",
    "yield": "Makes about 4 cups",
    "ingredients": [
      "¼ cup pure olive oil",
      "½ medium yellow onion, diced",
      "4 to 5 large garlic cloves, chopped",
      "1 medium jalapeño, chopped",
      "4 cups canned black beans, drained, liquid reserved",
      "2 teaspoons ground cumin",
      "1 teaspoon kosher salt",
      "¼ teaspoon cayenne pepper"
    ],
    "steps": [
      "Heat a cast-iron skillet over medium-low heat for 2 minutes and then add the olive oil. Add the onion, garlic, and jalapeño and cook until the vegetables are soft but not browned, stirring them occasionally, about 10 minutes.",
      "Add the beans, cumin, salt, and cayenne. Smash the beans with a large fork or a potato masher until you have a mixture of textures: not too chunky, not too smooth. Cook, stirring occasionally, until the mixture is sweetly fragrant and has thickened slightly, about 10 minutes. Taste the beans to check if they’re tender. If not, stir in ¼ cup of the reserved bean liquid and cook 5 minutes more and taste again. Add bean liquid until the desired consistency is reached (we make our beans so they are a little thicker than soup; if you run out of bean liquid, add water). Serve immediately or refrigerate in an airtight container for up to 3 days."
    ],
    "images": [],
    "source_file": "OEBPS/xhtml/c04.xhtml",
    "ingredient_count": 8,
    "step_count": 2,
    "image_count": 0
  },
  {
    "title": "Mexican-ish Risotto",
    "headnote": "Unlike the standard rice cooking method, the technique in this recipe calls for gradually adding the liquid, ladleful by ladleful, to make a creamy porridge, sort of like Italian risotto. We add some chile and cinnamon to make it a little Mexican. While this is technically a savory dish, the cinnamon adds just enough of a sweet note that you can add honey, maple syrup, or agave and butter and have it for breakfast. If you’re serving it classic-style for dinner, try it with Grilled Spicy Diablo Shrimp ( this page ) or pan-fried with chorizo and a fried egg.",
    "yield": "Serves 6",
    "ingredients": [
      "1½ cups full-fat coconut milk",
      "2 tablespoons pure olive oil",
      "2 cups short-grain brown rice",
      "½ cup chopped white or yellow onion",
      "2 garlic cloves, chopped",
      "1 tablespoon cumin seeds",
      "1 dried bay leaf",
      "½ cinnamon stick, or ¼ teaspoon ground cinnamon",
      "1 whole dried chile de árbol",
      "Kosher salt",
      "Freshly ground black pepper"
    ],
    "steps": [
      "In a medium pot set over medium-low heat, combine 3 cups of water with the coconut milk and heat until the liquid is warm. Reduce the heat to low.",
      "In a second medium pot, heat the oil over medium-high heat until it is shimmering, about 2 minutes. Add the rice, onion, garlic, cumin seeds, bay leaf, cinnamon stick, and chile and toast, stirring, until the rice is well coated in the oil and the spices are fragrant, about 2 minutes. Reduce the heat to medium-low.",
      "Add 1 cup of the warm coconut liquid to the rice and stir until it is absorbed, 5 to 8 minutes. Continue to add more liquid, 1 cup at a time, stirring constantly, until the rice is tender (but still a little al dente at the core), 25 to 30 minutes total. Stir in the remaining ½ cup of coconut liquid and season to taste with salt and pepper. Discard the bay leaf, cinnamon stick, and chile before serving."
    ],
    "images": [
      "../images/0776_Trej_9781984826855_art_r1.jpg",
      "../images/0017_Trej_9781984826855_art_r1.jpg"
    ],
    "source_file": "OEBPS/xhtml/c04.xhtml",
    "ingredient_count": 11,
    "step_count": 3,
    "image_count": 2
  },
  {
    "title": "Trejo’s Donuts",
    "headnote": "Donuts are a no-joke undertaking that take 2 days of work and love. What you get in return is a food that is about as amazing as food can be. Perfection, though, is fleeting, because 4 hours out of the fryer, they lose that magic. Which is why every donut shop in town sells their donuts for half price at the end of the day. Honest to god, they’re best enjoyed right out of the fryer. This recipe is for a plain yeasted donut, delicious on its own and the starting point for the Margarita, the Abuelita, and the Lowrider Donuts (beginning on this page ).",
    "yield": "Makes 2 dozen 3-inch donuts and 2 dozen donut holes",
    "ingredients": [
      "½ cup buttermilk",
      "2¼ teaspoons active dry yeast",
      "4 cups sifted all-purpose flour, plus extra for rolling",
      "Scant ½ cup sugar",
      "2 teaspoons kosher salt",
      "8 tablespoons (1 stick) unsalted butter, at room temperature",
      "Scant ¾ cup full-fat sour cream",
      "3 large eggs, beaten",
      "1 teaspoon vanilla extract",
      "2 quarts (8 cups) vegetable oil"
    ],
    "steps": [
      "Make the Dough In a small saucepan set over low heat, warm the buttermilk to 110°F. Remove the pan from the heat and whisk the yeast into the warm buttermilk. Set aside until thickened, about 10 minutes.",
      "Meanwhile, put the flour, sugar, salt, butter, sour cream, eggs, and vanilla in the bowl of a stand mixer.",
      "Add the thickened buttermilk mixture to the mixer bowl, and using the paddle attachment, mix the ingredients together on low speed, stopping every 20 seconds or so to scrape the sides of the bowl, until the mixture is shaggy and no dry ingredients are visible, 1 to 2 minutes. Raise the speed to medium and mix until the dough is well combined and smooth, about 2 minutes. Remove the paddle attachment and switch to the mixer’s hook attachment. Knead/mix on medium-low speed for about 5 minutes, until the dough has a smooth and stretchy consistency.",
      "Let the Dough Rise Spray a large bowl with nonstick pan spray (or grease it with a little oil). Transfer the dough to the bowl and lay a sheet of plastic wrap directly on the surface of the dough (this prevents the surface of the dough from drying out). Set the bowl aside in a draft-free spot and let the dough rise at room temperature until doubled in size, about 2 hours.",
      "Line a sheet pan with parchment paper, and coat it lightly with pan spray. Transfer the dough to the prepared sheet pan. Wrap the dough and sheet pan (together) tightly with plastic wrap and refrigerate overnight.",
      "Remove the dough from the refrigerator and discard the plastic wrap. Transfer the dough to a lightly floured work surface, flour a rolling pin, and roll the dough until it’s ½ inch thick. Let it rest for 10 minutes.",
      "Meanwhile, line two sheet pans with parchment paper and flour them generously.",
      "Using a 3-inch donut cutter, stamp out donuts close together (so you don’t waste dough). If you don’t have a donut cutter, use a 1-inch cookie cutter to stamp out a small round of dough from the center of each donut. Transfer the big donuts and the small donut holes to the prepared sheet pans, placing them a couple of inches apart from each other. Let the donuts proof in a warm, draft-free area until they have increased in size by one-third, about 1 hour.",
      "Fry the Donuts If using a deep fryer, follow the manufacturer’s directions to heat the oil to 350°F. (Alternatively, attach a candy thermometer to a large deep heavy-bottomed pot, making sure the tip of the thermometer does not touch the bottom of the pot. Fill the pot with the oil and heat it slowly to 350°F over medium-low heat.) Once the oil reaches this temperature, try to maintain it. If it gets too hot, simply turn the heat down or off until it reduces to 350°F.",
      "Carefully lower no more than 3 donuts at a time into the oil (if you overcrowd the oil with donuts, they’ll cool the oil and absorb it—making for greasy, sad donuts). Fry the donuts for about 1 minute on each side, gently turning them over with a spider strainer, until they are golden brown. Remove the cooked donuts with the spider strainer and set them on a wire cooling rack to drain. Let the oil rewarm to 350°F if necessary, then add a few more donuts to the pot. Repeat until all of the donuts are fried.",
      "Follow these same frying instructions for the donut holes, cooking up to 8 at a time and frying both sides until golden brown. Keep in mind that they will need a bit less time to fry than the donuts due to their smaller size. Remove the cooked donut holes with the spider strainer and drain them on a cooling rack. Serve immediately or within 4 hours."
    ],
    "images": [
      "../images/0256_Trej_9781984826855_art_r1.jpg"
    ],
    "source_file": "OEBPS/xhtml/c05.xhtml",
    "ingredient_count": 10,
    "step_count": 11,
    "image_count": 1
  },
  {
    "title": "Margarita Donuts",
    "headnote": "I don’t consume alcohol in any form, so that means I don’t eat this donut, but people tell me it’s amazing. It’s our basic yeasted donut with a tequila-lime glaze.",
    "yield": "Makes 2 dozen donuts and 2 dozen donut holes",
    "ingredients": [
      "1 recipe fried Trejo’s Donuts ( this page ), still hot, placed on wire racks",
      "Tequila–Key Lime Glaze",
      "3 cups confectioners’ sugar",
      "5 tablespoons fresh Key lime or Persian lime juice",
      "2 tablespoons blanco tequila",
      "1½ teaspoons Lyle’s Golden Syrup (see Trejo’s Tip), light corn syrup, or honey",
      "Maldon salt, for sprinkling",
      "Grated zest of 2 limes"
    ],
    "steps": [
      "Sift the confectioners’ sugar into a large bowl. In a small bowl, combine the lime juice, tequila, and golden syrup. Add the liquid mixture to the confectioners’ sugar and whisk together until smooth.",
      "Using a rubber spatula, spread the glaze over the top half of the donuts. Sprinkle the Maldon salt and lime zest over the glaze. Let the glaze set up, about 5 minutes, and eat the donuts immediately or within 4 hours (see Trejo’s Tip, this page )."
    ],
    "images": [
      "../images/0773_Trej_9781984826855_art_r1.jpg"
    ],
    "source_file": "OEBPS/xhtml/c05.xhtml",
    "ingredient_count": 8,
    "step_count": 2,
    "image_count": 1
  },
  {
    "title": "The Abuelita",
    "headnote": "A donut topped with two kinds of chocolate—a creamy glaze plus a crunchy crumb topping—is a very good donut. This is another of our top sellers.",
    "yield": "Makes 2 dozen donuts and 2 dozen donut holes",
    "ingredients": [
      "1 recipe fried Trejo’s Donuts ( this page ), still hot, placed on wire racks",
      "Chocolate Crumb Topping",
      "½ cup confectioners’ sugar",
      "⅓ cup all-purpose flour",
      "⅓ cup unsweetened Dutch-processed cocoa powder (we use Valrhona)",
      "¼ teaspoon kosher salt",
      "10 tablespoons (1¼ sticks) unsalted butter, cut into ½-inch pieces",
      "Dark Chocolate Glaze",
      "4 cups confectioners’ sugar",
      "1½ cups heavy cream",
      "1½ teaspoons Lyle’s Golden Syrup (see Trejo’s Tip, this page ), light corn syrup, or honey",
      "¼ teaspoon vanilla extract",
      "4½ ounces 70% cacao bittersweet chocolate (we use the Guanaja variety from Valrhona), chopped (about ½ cup)"
    ],
    "steps": [
      "Make the Topping Preheat the oven to 325°F.",
      "Put the confectioners’ sugar, flour, cocoa powder, and salt in the bowl of a food processor and pulse to combine. Add the butter cubes and pulse until the texture looks like a very fine streusel (you don’t want to see any chunks of butter—but be careful not to over-blend). Transfer the crumbs to a parchment paper–lined sheet pan and spread them out evenly. Bake until the streusel is lightly toasted, about 15 minutes. Remove the pan from the oven and set it aside to let the topping cool completely. The crumbs will crisp as they cool.",
      "Make the Glaze Sift the confectioners’ sugar into a large bowl. In a medium bowl, whisk together the cream, golden syrup, and vanilla. Add the liquid mixture to the confectioners’ sugar and whisk together until smooth.",
      "Place the chopped chocolate in a microwave-safe bowl and melt it in 30-second bursts, stirring after each, until the chocolate is just melted and smooth. Add the chocolate to the sugar/cream mixture and stir to combine (the glaze will be thick). Set the glaze aside at room temperature.",
      "Finish the Donuts Using a rubber spatula, spread the glaze on top of the donuts. Sprinkle the chocolate crumble on top and let the glaze set up, about 5 minutes. Serve immediately or within 4 hours of making (see this page )."
    ],
    "images": [
      "../images/0306_Trej_9781984826855_art_r1.jpg"
    ],
    "source_file": "OEBPS/xhtml/c05.xhtml",
    "ingredient_count": 13,
    "step_count": 5,
    "image_count": 1
  },
  {
    "title": "The Lowrider",
    "headnote": "This delicious cinnamon-sugar donut is another one of our best sellers.",
    "yield": "Makes 2 dozen donuts and 2 dozen donut holes",
    "ingredients": [
      "Cinnamon-Sugar Topping",
      "1 cup sugar",
      "1 teaspoon ground cinnamon",
      "½ teaspoon fine sea salt",
      "1 recipe fried Trejo’s Donuts ( this page ), still hot, placed on wire racks"
    ],
    "steps": [
      "In a small bowl, whisk together the sugar, cinnamon, and sea salt. One minute after removing the donuts from the oil, sprinkle them generously with the cinnamon sugar (you want the donuts to be warm so the cinnamon sugar sticks to them). Eat immediately or within 4 hours of making (see Trejo’s Tip, this page )."
    ],
    "images": [
      "../images/0280_Trej_9781984826855_art_r1.jpg"
    ],
    "source_file": "OEBPS/xhtml/c05.xhtml",
    "ingredient_count": 5,
    "step_count": 1,
    "image_count": 1
  },
  {
    "title": "Nacho Donuts",
    "headnote": "If you’ve never had our Nacho Donut, you’re missing out on one of the greatest breakfast inventions of all time. It’s a donut. But it’s nachos. All in one. It’s not too sweet, it’s just spicy enough, and it’s amazing.",
    "yield": "Makes 2 dozen donuts and 2 dozen donut holes",
    "ingredients": [
      "½ cup buttermilk",
      "2¼ teaspoons active dry yeast",
      "4 cups sifted all-purpose flour, plus extra for rolling",
      "⅓ cup sugar",
      "2 teaspoons kosher salt",
      "8 tablespoons (1 stick) unsalted butter, at room temperature",
      "Scant ¾ cup sour cream",
      "3 large eggs, beaten",
      "¾ cup grated cheddar cheese, plus ¾ cup for garnish",
      "1 tablespoon hot sauce, such as Trejo’s, Tapatío, or Cholula",
      "½ cup minced roasted poblano chiles (see mashed potatoes on this page for method)",
      "2 tablespoons minced fresh chives",
      "2 quarts (8 cups) vegetable oil"
    ],
    "steps": [
      "Make the Dough In a small saucepan set over low heat, warm the buttermilk to 110°F. Remove the pan from the heat and whisk the yeast into the warm buttermilk. Set aside until thickened, about 10 minutes.",
      "Meanwhile, put the flour, sugar, salt, butter, sour cream, eggs, ¾ cup of the cheese, and the hot sauce in the bowl of a stand mixer.",
      "Add the thickened buttermilk mixture to the mixer bowl, and using the paddle attachment, mix the ingredients together on low speed, stopping every 20 seconds or so to scrape the sides of the bowl, until the mixture is shaggy and no dry ingredients are visible, 1 to 2 minutes. Raise the speed to medium and mix until the dough is well combined and smooth, about 2 minutes. Add the minced chiles and chives, and mix until well incorporated, about 1 minute. Remove the paddle attachment and switch to the mixer’s hook attachment. Knead/mix on medium-low speed for about 5 minutes, until the dough has a smooth and stretchy consistency.",
      "Let the Dough Rise Spray a large bowl with nonstick pan spray (or grease it with a little oil). Transfer the dough to the bowl and lay a sheet of plastic wrap directly on the surface of the dough (this prevents the surface of the dough from drying out). Set the bowl aside in a draft-free spot and let the dough rise at room temperature until doubled in size, about 2 hours.",
      "Line a sheet pan with parchment paper and coat it lightly with pan spray. Transfer the dough to the prepared sheet pan. Wrap the dough and sheet pan (together) tightly with plastic wrap and refrigerate overnight.",
      "Remove the dough from the refrigerator and discard the plastic wrap. Transfer the dough to a lightly floured work surface, flour a rolling pin, and then roll the dough until it’s ½ inch thick. Let it rest for 10 minutes.",
      "Meanwhile, line two sheet pans with parchment paper and flour them generously.",
      "Use a 3-inch donut cutter to stamp out donuts close together (so you don’t waste dough). If you don’t have a donut cutter, use a 1-inch cookie cutter to stamp out a small round of dough from the center of each donut. Transfer the big donuts and the small donut holes to the prepared sheet pans, placing them a couple of inches apart from each other. Let the donuts proof in a warm, draft-free area until they have increased in size by one-third, about 1 hour.",
      "Fry the Donuts If you are using a deep fryer, follow the manufacturer’s directions to heat the oil to 350°F. (Alternatively, attach a candy thermometer to a large deep heavy-bottomed pot, making sure the tip of the thermometer does not touch the bottom of the pot. Fill the pot with the oil and heat it slowly to 350°F over medium-low heat.) Once the oil reaches this temperature, try to maintain it. If it gets too hot, simply turn the heat down or off until it reduces to 350°F.",
      "Carefully lower no more than 3 donuts at a time into the oil (if you overcrowd the oil with donuts, they’ll cool the oil and absorb it—making for greasy, sad donuts). Fry the donuts for about 1 minute on each side, gently turning them over with a spider strainer, until they are golden brown. Remove the cooked donuts with the spider strainer and set them on a wire cooling rack to drain. While they are still warm, sprinkle the donuts with some of the remaining grated cheese.",
      "Let the oil rewarm to 350°F if necessary, then add a few more donuts to the pot. Repeat until all of the donuts are fried, sprinkling them with cheese while they’re still warm.",
      "Follow these same frying instructions for the donut holes, adding up to 8 at a time and frying both sides until golden brown. Keep in mind that they will need a bit less time to fry than the donuts, due to their smaller size. Remove the cooked donut holes with the spider strainer and drain them on a cooling rack. Sprinkle them with the cheese while they’re still warm.",
      "Eat the Nacho Donuts and donut holes immediately or within 4 hours of cooking (see Trejo’s Tip, this page )."
    ],
    "images": [
      "../images/0779_Trej_9781984826855_art_r1.jpg"
    ],
    "source_file": "OEBPS/xhtml/c05.xhtml",
    "ingredient_count": 13,
    "step_count": 13,
    "image_count": 1
  },
  {
    "title": "Vegan Donuts",
    "headnote": "This recipe is for a plain vegan donut, the starting point for the Vegan Coco Loco Donuts ( this page ) and Vegan Berry Donuts ( this page ). Our dairy- and egg-free donuts are made with ripe banana, which gives them a tender, cake-like texture. Simply dust these with powdered sugar or top as we do at the shop. They say you eat with your eyes, and this pink beauty is as delicious as it looks. If you can’t find blueberry juice, feel free to substitute grape juice. This vegan donut gets a double hit of coconut flavor from the sweet Coco Lopez glaze and a toasted coconut topping.",
    "yield": "Makes 2 dozen donuts and 2 dozen donut holes",
    "ingredients": [
      "¼ cup solid vegetable shortening",
      "1 cup sugar",
      "1 large ripe banana, peeled and mashed",
      "4 cups cake flour or all-purpose flour, plus extra for rolling",
      "1 teaspoon baking powder",
      "1½ teaspoons salt",
      "Scant ¾ cup almond milk",
      "1 teaspoon apple cider vinegar",
      "1 teaspoon vanilla extract",
      "2 quarts (8 cups) vegetable oil",
      "Vegan Berry Glaze",
      "4 cups confectioners’ sugar",
      "2 teaspoons Lyle’s Golden Syrup (see Trejo’s Tip, this page ), light corn syrup, or honey",
      "½ cup berry jam (mixed berry or raspberry)",
      "¼ cup blueberry juice",
      "¼ cup unsweetened almond milk",
      "1 recipe fried Vegan Donuts ( this page ), still hot, placed on wire racks",
      "Coco Loco Glaze",
      "2½ cups confectioners’ sugar",
      "Scant ½ cup Coco Lopez coconut cream (mix well before measuring)",
      "1½ teaspoons Lyle’s Golden Syrup (see Trejo’s Tip, this page ), light corn syrup, or honey",
      "Toasted Coconut Topping",
      "1½ cups shredded unsweetened coconut",
      "1 recipe fried Vegan Donuts ( this page ), still hot, placed on wire racks"
    ],
    "steps": [
      "Make the Dough In the bowl of a stand mixer fitted with the paddle attachment, beat together the shortening and sugar on medium-low speed until the mixture is crumbly, like coarse cornmeal, about 2 minutes. Add the mashed banana and mix on medium-low speed until the ingredients are combined, about 2 minutes.",
      "Combine the flour, baking powder, and salt in a large bowl. In a medium bowl, combine the almond milk, apple cider vinegar, and vanilla. Alternate adding the flour mixture and the almond milk mixture to the banana mixture, mixing until combined and just smooth but not over-mixed, about 3 minutes. Transfer the dough to a floured surface, flour a rolling pin, and roll the dough until it’s ¾ inch thick.",
      "Line two sheet pans with parchment paper and flour them generously.",
      "Using a 3-inch donut cutter, stamp out donuts close together (so you don’t waste dough). If you don’t have a donut cutter, use a 1-inch cookie cutter to stamp out a small round of dough from the center of each donut. Transfer the big donuts and the small donut holes to the prepared sheet pans, about 1 inch apart.",
      "Fry the Donuts If you are using a deep fryer, follow the manufacturer’s directions to heat the oil to 350°F. (Alternatively, attach a candy thermometer to a large deep heavy-bottomed pot, making sure the tip of the thermometer does not touch the bottom of the pot. Fill the pot with the oil and heat it slowly to 350°F over medium-low heat.) Once the oil reaches this temperature, try to maintain it. If it gets too hot, simply turn the heat down or off until it reduces to 350°F.",
      "Carefully lower no more than 3 donuts at a time into the oil (if you overcrowd the oil with donuts, they’ll cool the oil and absorb it—making for greasy, sad donuts). Fry the donuts for 1 to 2 minutes on each side, gently turning them over with a spider strainer, until they are golden brown. Remove the cooked donuts with the spider strainer and set them on a cooling rack to drain. Let the oil rewarm to 350°F if necessary, then add a few more donuts to the pot. Repeat until all of the donuts are fried.",
      "Follow these same frying instructions for the donut holes, adding up to 8 at a time and frying both sides until golden brown. Keep in mind that they will need a bit less time to fry than the donuts, due to their smaller size. Remove the cooked donut holes with the spider strainer and drain them on a cooling rack. Serve immediately or within 4 hours (see Trejo’s Tip, this page ).",
      "Make the Glaze Combine the confectioners’ sugar, golden syrup, berry jam, blueberry juice, and almond milk in a large bowl, whisking until completely smooth.",
      "Glaze the donuts Using a rubber spatula, spread the glaze over the top half of the donuts and allow the glaze to set up, about 5 minutes. Serve immediately or within 4 hours (see Trejo’s Tip, this page ).",
      "Make the Glaze Combine the confectioners’ sugar, coconut cream, golden syrup, and 1½ tablespoons water in a large bowl and whisk until completely smooth.",
      "Make the Topping Place the coconut in a large skillet and cook it over medium-low heat, stirring frequently, until the flakes are mostly golden brown, about 3 minutes. Transfer the coconut to a large plate and let it cool completely.",
      "Glaze the donuts Using a rubber spatula, spread the glaze over the top half of the donuts. Sprinkle the donuts with the toasted coconut topping and allow the glaze to set up, about 5 minutes. Serve immediately or within 4 hours (see Trejo’s Tip, this page )."
    ],
    "images": [
      "../images/0275_Trej_9781984826855_art_r1.jpg",
      "../images/0801_Trej_9781984826855_art_r1.jpg"
    ],
    "source_file": "OEBPS/xhtml/c05.xhtml",
    "ingredient_count": 24,
    "step_count": 12,
    "image_count": 2
  },
  {
    "title": "Mexican Hot Chocolate Cookies",
    "headnote": "Here you have all the comforting, warming, and spicy flavors of Mexican hot chocolate in chocolate chocolate-chip cookie form. It’s essentially a double chocolate chip cookie that we dust with cinnamon sugar spiked with cayenne. This makes it taste like a chocolate version of the old-fashioned Red Hots candy.",
    "yield": "Makes 24 cookies",
    "ingredients": [
      "Cookie Dough",
      "2¼ cups all-purpose flour",
      "½ cup unsweetened Dutch-processed cocoa powder (such as Valrhona)",
      "2 teaspoons cream of tartar",
      "1 teaspoon baking soda",
      "½ teaspoon kosher salt",
      "1 cup (2 sticks) unsalted butter, at room temperature",
      "1½ cups sugar",
      "2 large eggs",
      "½ cup semisweet chocolate chips",
      "Cinnamon-Chile Sugar",
      "½ cup sugar",
      "2 tablespoons ground cinnamon",
      "½ teaspoon cayenne pepper"
    ],
    "steps": [
      "Make the Dough Preheat the oven to 400°F.",
      "Set a fine-mesh sieve over a medium bowl. Add the flour, cocoa powder, cream of tartar, baking soda, and salt to the sieve, and sift into the bowl.",
      "In the bowl of a stand mixer fitted with the paddle attachment, beat the butter and sugar together on medium-low speed to combine. Increase the speed to high and beat, scraping down the sides and bottom of the bowl as needed, until light and creamy, about 1 minute. Reduce the speed to medium-low and add the eggs, one at a time, beating well on medium-high after each addition. Reduce the speed to medium-low and add the flour mixture, a little at a time, until there aren’t any pockets of flour remaining. Reduce the speed to low, slowly add the chocolate chips, and mix until they are evenly dispersed, about 30 seconds. Scrape down the sides and bottom of the bowl.",
      "Make the Cinnamon-Chile Sugar In a shallow soup bowl or on a dinner plate, stir together the sugar, cinnamon, and cayenne until thoroughly mixed. Set aside.",
      "Bake the Cookies Line a sheet pan with parchment paper. Form 2 tablespoons of the cookie dough into a ball (about the size of a Ping-Pong ball) and roll it in the cinnamon-chile sugar topping. Repeat with the remaining dough. Place the balls on the parchment paper–lined sheet pan, spacing them 3 inches apart (you will need to bake the cookies in batches). Bake the cookies until they’ve flattened and are just set, about 12 minutes, rotating the pan halfway through baking.",
      "Remove the pan from the oven, transfer the cookies to a wire rack, and let them cool completely before serving. Store the cooled cookies in an airtight container for up to 3 days."
    ],
    "images": [
      "../images/0775_Trej_9781984826855_art_r1.jpg"
    ],
    "source_file": "OEBPS/xhtml/c05.xhtml",
    "ingredient_count": 14,
    "step_count": 6,
    "image_count": 1
  },
  {
    "title": "Rice Pudding",
    "headnote": "This is a rich, creamy, and decadent dish that we serve cold at the restaurant. It makes a great dessert or even a sugary boost to the day at breakfast.",
    "yield": "Makes 5 cups",
    "ingredients": [
      "1½ cups arborio rice",
      "2 quarts (8 cups) whole milk",
      "½ cup sugar",
      "¼ teaspoon ground cinnamon, plus extra for serving",
      "¼ teaspoon kosher salt",
      "2 large eggs",
      "½ cup heavy cream",
      "1 teaspoon vanilla extract",
      "½ teaspoon freshly grated nutmeg"
    ],
    "steps": [
      "In a large pot, combine the rice, milk, sugar, cinnamon, and salt. Cook over medium heat, stirring often, until the mixture begins to bubble rapidly. Then reduce the heat to medium-low and simmer gently, stirring often, until the mixture is slightly thicker than cream, 30 to 45 minutes.",
      "Meanwhile, in a small bowl, whisk together the eggs and the cream.",
      "Once the rice is cooked, whisk in the cream mixture and stir for about 3 minutes, until slightly thickened. Remove the pot from the heat. Stir in the vanilla and nutmeg. Let the rice pudding cool to room temperature and serve it with extra cinnamon on top, or transfer it to an airtight container and refrigerate it to serve chilled. The rice pudding will keep for up to 3 days in the refrigerator."
    ],
    "images": [
      "../images/0785_Trej_9781984826855_art_r1.jpg"
    ],
    "source_file": "OEBPS/xhtml/c05.xhtml",
    "ingredient_count": 9,
    "step_count": 3,
    "image_count": 1
  },
  {
    "title": "Churros",
    "headnote": "If you don’t love churros, the ridged, crispy, but tender donut-like Mexican treat, you’re not human. Sorry. (And if you’re allergic to gluten, that’s no excuse, either: you can make these with gluten-free flour instead of wheat flour!) Churros are all things good about dessert: cinnamony, crunchy, cakey, salty, sweet, fried, handheld. Yes, these are a bit of a project. But churros are worth it because, at the end of the day, you’re going to have homemade hot churros in your own home! One tip to help you streamline: you can make the batter and pipe out little uncooked churros onto a baking sheet lined with parchment paper and freeze them a week or so before you’re going to cook them. That way all you have to do when you want to serve them is fry them up and toss them in cinnamon sugar. Just like that, you’re a hero.",
    "yield": "Makes about twenty 5-inch churros",
    "ingredients": [
      "1 cup (2 sticks) unsalted butter",
      "1 cup sugar",
      "2 teaspoons kosher salt",
      "2 cups all-purpose flour",
      "2 teaspoons vanilla extract",
      "6 large eggs",
      "1 quart (4 cups) canola oil",
      "2 tablespoons ground cinnamon"
    ],
    "steps": [
      "Make the Churro Batter Place the butter, ½ cup of the sugar, the salt, and 2 cups of water in a medium pot and bring to a boil over medium heat, stirring, until the butter and sugar are melted. Remove the pan from the heat and let the mixture cool until its temperature falls below 125°F on an instant-read thermometer (you don’t want the eggs to scramble when you add them to the liquid).",
      "Off the heat, add the flour all at once and mix vigorously with a wooden spoon to incorporate it until the mixture forms a loose batter.",
      "Transfer the churro batter to the bowl of a stand mixer. Using the paddle attachment, beat the batter on medium-low speed for a few seconds just to let off some heat. Add the vanilla, then add the eggs, 2 at a time, scraping the sides of the bowl with a rubber spatula after each addition. Beat until the eggs are fully incorporated and the dough is smooth and a little stretchy. Transfer the dough to a large pastry bag fitted with a #828 star tip.",
      "Fry the Churros Set a wire rack on a sheet pan or line a sheet pan with a double layer of paper towels.",
      "In a large deep pot or a deep fryer, heat the canola oil to 365°F. Once the oil is hot, hold the pastry bag a few inches above the oil and pipe a 5-inch length of dough directly into the hot oil, moving the bag across the oil as you pipe (use your finger or the tip of a knife to break off the dough from the piping bag). Repeat one or two times (you don’t want to overcrowd the pot). Fry the churros until they are golden brown, about 1 minute on each side. Use a frying spider to transfer the churros to the prepared sheet pan. Repeat, piping more dough into the hot oil, until you have used all the dough.",
      "Add the remaining ½ cup sugar and the cinnamon to a small paper bag and shake to combine. Add a still-warm churro to the bag and shake lightly to evenly coat the churro on all sides (you want it warm so the cinnamon sugar will stick). Place it on a serving platter. Repeat with the remaining churros and topping.",
      "Churros are awesome eaten warm, or preferably within 1 hour of frying."
    ],
    "images": [
      "../images/0755_Trej_9781984826855_art_r1.jpg"
    ],
    "source_file": "OEBPS/xhtml/c05.xhtml",
    "ingredient_count": 8,
    "step_count": 7,
    "image_count": 1
  },
  {
    "title": "Cucumber Cilantro Margarita",
    "headnote": "This is a refreshing, summery spin on a margarita. “Muddling” is a fancy term for smashing vegetables and herbs to release their juices and essential oils. In this case you smash a few pieces of cucumber and a sprig of cilantro in a cocktail shaker before adding the alcohol. You can buy a drinks muddler designed specifically for the task, or you can just use the end of a wooden spoon to do the mashing. Shaking the cocktail vigorously for 4 seconds is crucial, not just to cool down the drink and incorporate the ingredients, but also to melt a little of the ice so it dilutes the drink slightly and brings all the flavors into balance.",
    "yield": "Makes 1 margarita",
    "ingredients": [
      "Kosher salt, optional",
      "4 thin slices cucumber, plus a ¼-inch-thick slice for garnish",
      "2 sprigs fresh cilantro",
      "½ cup ice cubes",
      "2 ounces (¼ cup) silver tequila",
      "1 ounce (2 tablespoons) fresh lime juice",
      "½ ounce (1 tablespoon) agave syrup",
      "½ ounce (1 tablespoon) Bols Triple Sec"
    ],
    "steps": [
      "To salt the rim of your glass, fill a shallow bowl with water. On a small plate, pour a circle of salt. Dip the rim of a rocks glass or margarita glass in the water, then dip it into the salt and set it aside.",
      "In the bottom of a cocktail shaker, muddle the 4 cucumber slices with 1 cilantro sprig until the cucumber releases most of its juices and the cilantro is smashed and fragrant. Add the ice cubes, tequila, lime juice, agave syrup, and triple sec. Cover and shake vigorously for 4 seconds. Pour the drink, including the ice, into the glass. Serve the margarita garnished with the remaining cucumber slice and cilantro sprig."
    ],
    "images": [
      "../images/0757_Trej_9781984826855_art_r1.jpg",
      "../images/num_drinks.jpg"
    ],
    "source_file": "OEBPS/xhtml/c06.xhtml",
    "ingredient_count": 8,
    "step_count": 2,
    "image_count": 2
  },
  {
    "title": "Red Chile Margarita",
    "headnote": "We muddle red Fresno chiles into this spicy margarita to give it a kick, and then we garnish it with Tajín seasoning—the slightly spicy, tangy, and salty powder you see street-corner fruit vendors in L.A. sprinkling on cut fruit. If you can’t find Fresnos, you can use jalapeños, which are slightly hotter.",
    "yield": "Makes 1 margarita",
    "ingredients": [
      "Kosher salt, optional",
      "2 to 3 thin slices Fresno chile, plus 1 extra slice for garnish",
      "½ cup ice cubes",
      "2 ounces (¼ cup) silver tequila",
      "1 ounce (2 tablespoons) fresh lime juice, plus 1 lime wheel for garnish",
      "½ ounce (1 tablespoon) agave syrup",
      "¾ ounce (1½ tablespoons) Bols Triple Sec",
      "Tajín seasoning, to taste (see this page )"
    ],
    "steps": [
      "To salt the rim of your drink, fill a shallow bowl with water. On a small plate, pour a circle of salt. Dip the rim of a rocks glass or margarita glass in the water, then dip it into the salt and set it aside.",
      "In the bottom of a cocktail shaker, muddle the Fresno chile slices until slightly smashed and they release their juices. Add the ice, tequila, lime juice, agave syrup, and triple sec. Cover and shake vigorously for 4 seconds. Pour all of the ingredients, including the ice, into the glass. Sprinkle the top of the drink with Tajín, and garnish it with the lime wheel and chile slice."
    ],
    "images": [],
    "source_file": "OEBPS/xhtml/c06.xhtml",
    "ingredient_count": 8,
    "step_count": 2,
    "image_count": 0
  },
  {
    "title": "Lavender Margarita",
    "headnote": "This is a very Los Angeles spin on the margarita. Some people might associate lavender with exotic locales in the South of France, but the fragrant flower almost grows wild in front yards and on parkways in Los Angeles. We double the lavender flavoring here by using both lavender syrup and lavender bitters. You can easily buy Torani lavender syrup online, as well as any number of brands of lavender bitters. If you want to make this drink even more Angeleno, use the Greenbar Distillery’s Bar Keep lavender bitters, which are organic and are made in downtown L.A.",
    "yield": "Makes 1 margarita",
    "ingredients": [
      "½ cup ice cubes",
      "2 ounces (¼ cup) silver tequila",
      "1 ounce (2 tablespoons) fresh lime juice",
      "½ ounce (1 tablespoon) lavender syrup",
      "½ ounce (1 tablespoon) Bols Triple Sec",
      "3 to 4 dashes lavender bitters",
      "Edible lavender buds, optional"
    ],
    "steps": [
      "In a cocktail shaker, combine the ice, tequila, lime juice, lavender syrup, triple sec, and bitters. Cover and shake vigorously for 4 seconds. Pour the ingredients, including the ice, into a rocks glass. Garnish with the lavender buds, if using."
    ],
    "images": [
      "../images/0646_Trej_9781984826855_art_r1.jpg"
    ],
    "source_file": "OEBPS/xhtml/c06.xhtml",
    "ingredient_count": 7,
    "step_count": 1,
    "image_count": 1
  },
  {
    "title": "Pineapple Cinnamon Margarita",
    "headnote": "Sweet and tangy pineapple and warming cinnamon make this margarita a vacation in a glass. Leave out the tequila and triple sec for a refreshing—yet unpredictable—non-alcoholic drink.",
    "yield": "Makes 1 margarita",
    "ingredients": [
      "½ cup ice cubes",
      "2 ounces (¼ cup) silver tequila",
      "½ ounce (1 tablespoon) pineapple juice",
      "½ ounce (1 tablespoon) fresh lime juice",
      "½ ounce (1 tablespoon) agave syrup",
      "½ ounce (1 tablespoon) Bols Triple Sec",
      "¼ teaspoon ground cinnamon, plus more for garnish",
      "1 pineapple wedge, for garnish"
    ],
    "steps": [
      "In a cocktail shaker, combine the ice, tequila, pineapple juice, lime juice, agave syrup, triple sec, and cinnamon. Cover and shake vigorously for 4 seconds. Pour the drink, including the ice, into a rocks glass. Garnish with a few dashes of ground cinnamon and the pineapple wedge."
    ],
    "images": [],
    "source_file": "OEBPS/xhtml/c06.xhtml",
    "ingredient_count": 8,
    "step_count": 1,
    "image_count": 0
  },
  {
    "title": "Lime in the Coconut Margarita",
    "headnote": "If you like piña coladas, you’ll love this rich and sweet double-coconut margarita. Instead of a salted rim, this drink gets garnished with a rim of shredded coconut.",
    "yield": "Makes 1 margarita",
    "ingredients": [
      "Shredded sweetened coconut",
      "½ cup ice cubes",
      "2 ounces (¼ cup) silver tequila",
      "¾ ounce (1½ table-spoons) fresh lime juice, plus 1 lime wheel for garnish",
      "1 ounce (2 tablespoons) Coco Lopez coconut cream",
      "½ ounce (1 tablespoon) Bols Triple Sec"
    ],
    "steps": [
      "Fill a shallow bowl with water. On a small plate, pour a circle of shredded coconut. Dip the rim of a rocks glass or margarita glass in the water, then dip it into the coconut and set it aside.",
      "In a cocktail shaker, combine the ice, tequila, lime juice, coconut cream, and triple sec. Cover and shake vigorously for 4 seconds. Pour the drink, including the ice, into the prepared glass. Garnish with the lime wheel."
    ],
    "images": [],
    "source_file": "OEBPS/xhtml/c06.xhtml",
    "ingredient_count": 6,
    "step_count": 2,
    "image_count": 0
  },
  {
    "title": "Hibiscus Margarita",
    "headnote": "In addition to making a delicious agua fresca , hibiscus, also called flor de Jamaica , makes a mean margarita. While we make our own hibiscus syrup and garnish the drink with a hibiscus flower to make it extra-fancy, you can also make the syrup with Red Zinger or other bagged tea made with hibiscus. Don’t worry—your marg will still taste amazing.",
    "yield": "Makes 1 margarita",
    "ingredients": [
      "½ cup ice cubes",
      "2 ounces (¼ cup) silver tequila",
      "½ ounce (1 tablespoon) hibiscus syrup (see following)",
      "½ ounce (1 tablespoon) fresh lime juice",
      "½ ounce (1 tablespoon) agave syrup",
      "½ ounce (1 tablespoon) Bols Triple Sec",
      "Hibiscus flower or lime wheels, for garnish (optional)"
    ],
    "steps": [
      "In a cocktail shaker, combine the ice, tequila, hibiscus syrup, lime juice, agave syrup, and triple sec. Cover and shake vigorously for 4 seconds. Pour the drink, including the ice, into a rocks glass. Garnish with a hibiscus flower or lime wheels, if using."
    ],
    "images": [],
    "source_file": "OEBPS/xhtml/c06.xhtml",
    "ingredient_count": 7,
    "step_count": 1,
    "image_count": 0
  },
  {
    "title": "Michelada",
    "headnote": "Sometimes people want a drink, but don’t want to drink too much, if you know what I’m saying. A michelada is a great compromise. It’s sort of like a low-alcohol Mexican bloody mary.",
    "yield": "Makes 4 micheladas",
    "ingredients": [
      "1½ cups tomato juice",
      "⅓ cup lime juice, from 3 to 4 limes, plus 1 lime wedge, for the rims of the glasses, and 4 lime wheels, for garnish",
      "2 teaspoons Worcestershire sauce",
      "1½ teaspoons hot sauce",
      "2 tablespoons kosher salt",
      "2 tablespoons Tajín seasoning (see this page )",
      "2 bottles of light Mexican beer",
      "Freshly ground black pepper"
    ],
    "steps": [
      "In a pitcher, combine the tomato juice, lime juice, Worcestershire sauce, and hot sauce.",
      "Mix the salt and Tajín seasoning on a small plate. Run the lime wedge around the rim of each glass, then dip each rim in the mixture.",
      "Fill the glasses halfway with ice. Divide the tomato juice mixture evenly between the glasses. Top with beer and gently stir. Add a pinch of pepper to each drink, garnish each glass with a lime wheel, and serve."
    ],
    "images": [
      "../images/0192_Trej_9781984826855_art_r1.jpg",
      "../images/0769_Trej_9781984826855_art_r1.jpg"
    ],
    "source_file": "OEBPS/xhtml/c06.xhtml",
    "ingredient_count": 8,
    "step_count": 3,
    "image_count": 2
  },
  {
    "title": "Strawberry Lemonade",
    "headnote": "This is ridiculously easy to make and ten times more delicious than any soda or soft drink that comes in a can. You’re going to want to break out your electric juicer for this one.",
    "yield": "Makes six 8-ounce servings",
    "ingredients": [
      "1 pound fresh strawberries, hulled (about 3 cups)",
      "2 cups fresh lemon juice (from 8 to 10 lemons)",
      "1 cup sugar",
      "6 slices of lime, for garnish (optional)"
    ],
    "steps": [
      "In a blender, combine the strawberries, lemon juice, and sugar and puree until smooth. Strain the puree through a fine-mesh strainer into a large pitcher. Add 4 cups of water and stir to combine. Chill, and serve in tall glasses over ice, each glass garnished with a slice of lime, if using."
    ],
    "images": [],
    "source_file": "OEBPS/xhtml/c06.xhtml",
    "ingredient_count": 4,
    "step_count": 1,
    "image_count": 0
  },
  {
    "title": "Date-Sweetened Horchata",
    "headnote": "The rich and sweet cinnamon-flavored rice drink horchata is like dessert in a glass. A lot of the horchata you buy in stores and restaurants is sweetened with corn syrup. Ours gets most of its sweetness from sugary dates grown in the desert. When you store this in the refrigerator, it will separate, so just stir it before serving. You need to start this a day in advance of serving.",
    "yield": "Makes about ten 8-ounce servings",
    "ingredients": [
      "1½ pounds (about 4 cups) pitted dried Medjool dates",
      "1 pound basmati rice, rinsed and drained",
      "½ cup sugar",
      "1 cinnamon stick, plus extra for garnish (optional)",
      "Zest of 1 lemon, removed with a vegetable peeler",
      "6 cups unsweetened Califia Barista Blend almond milk"
    ],
    "steps": [
      "Put the dates in a large bowl and add water to cover. Cover the bowl with plastic wrap and set the dates aside at room temperature to soak overnight.",
      "The next day, combine the rice with 4 cups of hot water in a large bowl. Let sit for at least 2 hours at room temperature.",
      "Drain the soaked dates and put them in a stockpot. Add 3 cups of room-temperature water, the sugar, the cinnamon stick, and the lemon peel. Bring the water to a boil, stir until the sugar dissolves, and then remove the pot from the heat.",
      "Transfer the rice and its soaking water to a blender and blend until smooth. Strain the puree through a fine-mesh sieve into a large bowl to make rice milk.",
      "Remove the cinnamon stick and lemon peel from the date mixture. Put the date mixture in the blender and puree until smooth. Strain the date puree through the sieve into the bowl containing the strained rice water. Let the mixture cool to room temperature, and then add the almond milk. Stir to combine and refrigerate until cold.",
      "Serve the horchata over ice, garnished with cinnamon sticks, if using. It will keep in the refrigerator for up to 3 days."
    ],
    "images": [],
    "source_file": "OEBPS/xhtml/c06.xhtml",
    "ingredient_count": 6,
    "step_count": 6,
    "image_count": 0
  }
]